{"central_map": {"MoP": [], "MNRE": [], "MoF": [], "CEA": [], "CTUIL": [], "CERC": [{"type": "Orders", "title": "Petition seeking approval under Section 17 of the Electricity Act, 2003 for bringing on record the appointment of Vardhman Trusteeship Pvt. Ltd., Respondent No.2 as the Security Trustee and for creation of security interest over the assets of Petitioner in favour of the Security Trustee, acting on behalf of and for the benefit of the Lenders (and for any subsequent transferees, assign, novatees thereof and any refinancing lenders to the Project), by way of hypothecation and equitable mortgage on the Project assets, pursuant to unattested Deed of Pledge, Declaration, Undertaking and other Financing Agreements, for the development of the Transmission Project. Tumkur – II REZ Power Transmission Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/orders/546-MP-2025.pdf"}, {"type": "Orders", "title": "Petition for true-up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for Transmission Asset: RAPP – Kota 400 kV D/C line (part of RAPP - Jaipur (South) 400 kV D/C line with one ckt LILOed at Kota), along with associated bay at Kota under Transmission System associated with RAPP 7 and 8,  Part-A under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003, and under Regulation 15 (1) (a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023, read with Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019, and Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/orders/204-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of the transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset under “Northern Region System Strengthening Scheme-XXVII” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/orders/203-TT-2025.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Raghanesda RE Transmission Limited. Raghanesda RE Transmission Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/orders/725-TL-2025_I.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 period and determination of the transmission tariff for the 2024-29 period for the Combined Assets under “System Strengthening in the Southern Region – XIV” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/439-TT-2025_300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) & (f) and other applicable provisions of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Grant of Connectivity, Long Term Access and Medium-Term Open Access in the inter-State transmission and related matters) Regulations, 2009 against the cancellation of LTA granted by the Respondent and encashment of bank guarantee. Chettinad Power Corporation Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/788-MP-2025_300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) & (f) read with Section 38(2)(b) & (c) of the Electricity Act, 2003 along with Regulation 13(8) of the Central Electricity Regulatory Commission (Sharing of Inter-State Transmission Charges and Losses) Regulations, 2020. ACME Solar Holding Limited and Anr., AMPIN Energy Green Private Limited and Ors.", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/782-MP-2025_300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for Combined Assets under transmission system associated with Kaiga 3 and 4 (2x235 MW) Project in the Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/412-TT-2025-Anr._300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for Combined Asset under “Northern Region System Strengthening Scheme XXXIV” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/481-TT-2025-Anr._300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the Assets under Augmentation of Transformation Capacity at Fatehabad (PG) in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/194-TT-2025-Anr._300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for Assets under “Transfer of Power from Generation Projects in Sikkim to NR / WR Part-A” in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/58-TT-2025_300925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for 3 Nos. Asset under “POWERGRID works associated with North Eastern Region Strengthening Scheme-II, Part-B (NERSS-II-B)” in the North Eastern Region. Power Grid Corporation of India Limited", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/ROP/15-TT-2025_300925.pdf"}, {"type": "Schedule of Hearing", "title": "A+", "date": "2025-09-30", "url": "https://cercind.gov.in/Sched_hear.html"}, {"type": "Schedule of Hearing", "title": "A", "date": "2025-09-30", "url": "https://cercind.gov.in/Sched_hear.html"}, {"type": "Schedule of Hearing", "title": "A-", "date": "2025-09-30", "url": "https://cercind.gov.in/Sched_hear.html"}, {"type": "Schedule of Hearing", "title": "Acts & Policies", "date": "2025-09-30", "url": "https://cercind.gov.in/Sched_hear.html"}, {"type": "Schedule of Hearing", "title": "Advance Cause List Last modified: 30.09.2025 4:45PM", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/hearing_schedule/AV-OctV1.pdf"}, {"type": "Schedule of Hearing", "title": "Weekly Cause List Last modified: 30.09.2025 4:45PM", "date": "2025-09-30", "url": "https://cercind.gov.in/2025/hearing_schedule/WK-Oct.pdf"}, {"type": "What's New", "title": "Hearing Schedule", "date": "2025-09-30", "url": "https://cercind.gov.in/Sched_hear.html"}, {"type": "Schedule of Hearing", "title": "Advance Cause List Last modified: 29.09.2025 12:35PM", "date": "2025-09-29", "url": "https://cercind.gov.in/2025/hearing_schedule/AV-SepV13.pdf"}, {"type": "Schedule of Hearing", "title": "Weekly Cause List Last modified: 29.09.2025 12:35PM", "date": "2025-09-29", "url": "https://cercind.gov.in/2025/hearing_schedule/WK-SepV11.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Kurawar Transmission Limited to implement transmission project “Network expansion at 765/400/220kV Kurawar S/s for drawl of power by MPPTCL”. POWERGRID Kurawar Transmission Limited", "date": "2025-09-27", "url": "https://cercind.gov.in/2025/orders/689-TL-2025-I.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Bhuj Transmission Limited to implement transmission project “Augmentation of transformation capacity” at Bhuj-II PS (GIS) & Provision of ICT Augmentation and Bus Reactor at Bhuj-II PS under “Regulated Tariff Mechanism” (RTM) Mode. POWERGRID Bhuj Transmission Limited", "date": "2025-09-27", "url": "https://cercind.gov.in/2025/orders/688-TL-2025_I.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bikaner IV Transmission Limited to implement transmission project “Augmentation of 2x500 MVA (7th & 8th), 400/220 kV ICTs along with 220 kV Sectionalizer bay (1 set), 220 kV BC (1 no.) bay and 220 kV TBC (1 no.) bay at Bikaner-IV PS & Implementation of 3 nos. of 220 kV line bays for interconnection of M/s Furies Solren Private Limited (300MW) [1 no. bay] & M/s SJVN Green Energy Limited (500MW) [2 no. bays] RE power projects at 765/400/220kV Bikaner-IV PS under “Regulated Tariff Mechanism” (RTM) Mode. POWERGRID Bikaner IV Transmission Limited", "date": "2025-09-27", "url": "https://cercind.gov.in/2025/orders/686-TL-2025_I.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under the Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the Combined Asset under the scheme “Provision of Bus Reactors” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-09-27", "url": "https://cercind.gov.in/2025/orders/377-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act, 2003 read with Regulation 41 and 42 of the CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 (as amended) seeking extension of connectivity start date and corresponding milestones (including financial closure) for the 700 MW Solar Power Project at Solapur, Maharashtra. Welspun Narmada Private Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/815-MP-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition Under Section 79(1)(c), (f) and (k) of the Electricity Act, 2003 read with Regulation 41 and 42 of the CERC (Connectivity and General Network access to the Inter-State Transmission System) Regulations, 2022 (as amended) seeking Extension of Connectivity start date and corresponding milestones (Including Financial closure) for the 700 MW Solar Power Project at Solapur, Maharashtra. Waaree Forever Energies Private Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/814-MP-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(a) & (f) of the Electricity Act, 2003, read with Regulation 65(1) of the CERC (Conduct of Business) Regulations, 2023. Power & Electricity Department, Mizoram", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/484-MP-2024_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Barmer I Transmission Limited to implement transmission project “Implementation of 1 no. of 220 kV line bay for interconnection of M/s Anboto Solar Private Limited (250MW+50MW) RE power projects at 765/400/220kV Barmer-I PS” under “Regulated Tariff Mechanism” (RTM) Mode. POWERGRID Barmer I Transmission Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/789-TL-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003, read with Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023. TP Saurya Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/358-MP-2023_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under with Section 79 (1) (a), (f) and (k) of the Electricity Act, 2003 read with Regulation 102 of the CERC (Terms and Conditions of Tariff) Regulations, 2024 seeking relaxation of the Normative Plant Availability Factor for THDC Koteshwar Hydro Electric Project provided in terms of Regulation 71(A)(4) of the CERC Tariff Regulations, 2024 THDCIL", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/807-MP-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1) (a) & (k) r/w Section 62 of the Electricity Act, 2003 read with Chapter-V of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 & 2023 and Chapter-3, Regulation-8 of Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2014 for allowing expenditure towards procurement and capitalization of wagons for Kahalgaon Super Thermal Power Station, Stage-I (840 MW). NTPC", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/424-MP-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes on the issue of wrongful deduction of compensation towards alleged non-supply and non-submission of contract performance bank guarantee. Manikaran Power Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/378-MP-2023_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 for direction to UPPCL to make payment of balance outstanding, accumulated out of part payment of twelve quarter interest free instalments, along with interest (to be applicable from commencement of payment of instalments) to the Petitioner. MPPMCL", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/320-MP-2022_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of 2019-24 tariff and for determination  of tariff for the 2024-29 tariff in respect of Doyang Hydro Power Station (DHPS) (75MW) of NEEPCO, Shillong. North Eastern Electric Power Corporation Ltd", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/41-GT-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(b) & (f) of the Electricity Act, 2003 on behalf of the Petitioner seeking approval of Change in Law event and consequential relief of compensation through tariff adjustment payment. MB Power (Madhya Pradesh) Limited", "date": "2025-09-26", "url": "https://cercind.gov.in/2025/ROP/284-MP-2025_170725.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of the transmission licence to WRNES Talegaon Power Transmission Limited. WRNES Talegaon Power Transmission Limited", "date": "2025-09-25", "url": "https://cercind.gov.in/2025/orders/678-TL-2025-I.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by WRNES Talegaon Power Transmission Limited (a 100% wholly owned subsidiary of Adani Energy Solutions Limited). WRNES Talegaon Power Transmission Limited", "date": "2025-09-25", "url": "https://cercind.gov.in/2025/orders/679-AT-2025.pdf"}, {"type": "Orders", "title": "Application under Section 14 of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of Trading Licence and other related matters) Regulations, 2020 for the grant of inter-State trading licence. Mahagenco Renewable Energy Limited", "date": "2025-09-25", "url": "https://cercind.gov.in/2025/orders/445-TD-2025-f.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for a direction to the Respondents to pay additional fixed charge of Rs.0.439/KWH for the balance period of PPA (Interlocutory Application for bringing on record additional documents) APEDCL & ors., GMR Vemagiri Power Generation Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/463-MP-2014_230925.pdf"}, {"type": "Record of Proceedings", "title": "Interlocutory application under Section 94 of the Electricity Act, 2003 seeking direction(s) against the Respondents.94-IA-2025_230925 Adani Solar Energy Jodhpur Three Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/94-IA-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulations 57 and 58 of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking relaxation of Regulation 22(3)(c) for permitting trial runs and commissioning of Wind Turbine Generators (WTGS) in tranches of at least 10 MW for the Petitioner's Wind Power Project. Powerica Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/431-MP-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 r/w Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2009 seeking grant of the transmission licence to NERGS-I Power Transmission Limited. NERGS-I Power Transmission Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/322-TL-2024_230925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Regulation 38 read with Regulation 26(3)(b) of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking amendment of the Petition. Lakadia-Vadodara Transmission Project Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/89-IA-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1) (c) & (f) read with Section 38(2)(b)&(c) of the Electricity Act, 2003 along with Regulation 13(8) of the CERC (Sharing of Inter-State Transmission Charges and Losses) Regulations, 2020 Juniper Green Cosmic Private Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/817-MP-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act, 2003 read with Regulation 41 and 42 of the CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 (as amended) seeking extension of connectivity start date and corresponding milestones (including financial closure) for the 700 MW Solar Power Project at Solapur, Maharashtra. Waaree Forever Energies Private Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/814-MP-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 and Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters), Regulations, 2020 for grant of an Inter-State Trading Licence. ACME Greentech Eighth Private Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/780-TD-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 and Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters), Regulations, 2020 for grant of an inter-state trading licence. Energyminds Power Solutions Private Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/778-TD-2025_230925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Deviation Settlement Mechanism and Related Matters) Regulations, 2022, and the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022, and regarding arbitrary imposition of DSM Charges by SLDC on Petitioner in inter-state sale of power through power exchange under T-GNA. Mangalore Energies Private Limited", "date": "2025-09-23", "url": "https://cercind.gov.in/2025/ROP/432-MP-2025_230925.pdf"}, {"type": "Orders", "title": "Approval of transmission tariff of Combined Asset of LILO of 400 kV S/C Vindhyachal-Korba Transmission Line and 400 kV D/C Gandhar-Hazira Transmission line and 400/220 kV GIS Sub-station at Hazira and associated bays and 400 kV D/C Quad Moose Transmission Line from Mahan Thermal Power Plant-Sipat Pooling Sub-station and associated bays for the years 2012-13 and 2013-14 in the  2009-14 tariff period under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2009. Essar Power Transmission Company Limited", "date": "2025-09-22", "url": "https://cercind.gov.in/2025/orders/173-TT-2013-OR.pdf"}, {"type": "Notices / Letters", "title": "MOP Rules", "date": "2025-09-19", "url": "https://cercind.gov.in/MoP_Rules.html"}, {"type": "Record of Proceedings", "title": "Petition Under Section 79(1)(C), (F) and (K) of the Electricity Act, 2003 read with Regulation 41 and 42 of the CERC (Connectivity and General Network access to the Inter-State Transmission System) Regulations, 2022 (as amended) seeking Extension of Connectivity start date and corresponding milestones (Including Financial closure) for the 700 MW Solar Power Project at Solapur, Maharashtra. Waaree Forever Energies Private Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/814-MP-2025_180925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of transmission license to NER Expansion Transmission Limited. NER Expansion Transmission Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/755-TL-2025_180925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for 100 MW Solar PV Power Project (Tranche- VIII) connected to the Inter-State Transmission System (ISTS) and selected through competitive bidding process as per the guidelines of the Government of India. Solar Energy Corporation of India Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/723-AT-2025_180925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to MEL Power Transmission Limited. MEL Power Transmission Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/675-TL-2025_180925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 seeking extension of timelines of Connectivity and LTA for its Solar Power Project at Nokh Solar Park Rajasthan Solarpark Development Company Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/104-MP-2022_180925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulation 9.1 of the Central Electricity Regulatory Commission (Connectivity and General Network Access) Regulations, 2022 and other enabling powers seeking directions to CTUIL for issuance of final grant of connectivity. Avaada Energy Private Limited", "date": "2025-09-18", "url": "https://cercind.gov.in/2025/ROP/669-MP-2025_180925.pdf"}, {"type": "Orders", "title": "Petition under Section 79, including Section 79 (1)(c), 79 (1)(f) and 79 (1)(k) of the Electricity Act, 2003, seeking direction upon the Respondents to allow the said Petitioner to convert and continue its old connectivity under the new regime without the need of applying for GNA. Bharat Aluminium Company Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/orders/192-MP-2023.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 and 178 of the Electricity Act, 2003 read with the CERC (Indian Electricity Grid Code) Regulations 2023, the CERC (Ancillary Services) Regulations, 2022, the CERC (Deviation Settlement Mechanism and Related Matters) Regulations, 2024, and Commission’s Suo-Motu Orders in 7/SM/2023 and 2/SM/2025 to secure reliable grid operation. GRID Controller of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/713-MP-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of transmission charges, transmission losses and other conditions for the use of 24.23 km long 132 kV Double Circuit Dedicated Transmission Line of Malana Power Company Limited from its 86 MW Malana-I HEP Generating Station at Village-Chowki, Post Jari, District Kullu, Himachal Pradesh upto 33/132 kV Bajaura Sub-station of HPSEBL situated at Sarabhai, District Kullu, Himachal Pradesh. Malana Power Company Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/23-TT-2023_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and for determination of tariff for the period 2024-29 in respect of Indira Sagar Power Station (ISPS). NHDC Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/45-GT-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and determination of tariff for tariff period 2024-29 in respect of Omkareshwar Power Station (520 MW). NHDC Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/42-GT-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 28(4) of the Electricity Act, 2003 read with Regulation 10 of the CERC (Fees and Charges of Regional Load Despatch Centre and other related matters) Regulations, 2024 for determination of the fees and charges to be recovered by DVC LDC for the control period 2024-29. DVC LDC", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/366-MP-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (a) of the Electricity Act, 2003 read with the applicable provisions of the CERC (Terms & Conditions of Tariff) Regulations, 2024. NTPC Ltd.", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/227-MP-2024_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (b) and (f) of the Electricity Act 2003 seeking directions to GUVNL to make payment of certain amounts unilaterally deducted/ withheld from the monthly invoices and debit note/ supplementary invoices raised by JITPL Jindal India Thermal Power Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/203-MP-2024_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 period and determination of the transmission tariff for the 2024-29 period for “315 MVA ICT-III at Nagarjunasagar sub-station with associated bay equipments” in the Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/487-TT-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for the determination of tariff for 1x500 MVA, 400/230 kV ICT (4th) along with associated bays and equipment at Arasur Sub-station under Augmentation of Transformation Capacity by 1x500 MVA, 400 kV/230kV ICT (4th) at Arasur Sub-station. Power Grid Corporation of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/257-TT-2025-Ors_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the 2019-24 tariff period and determination of tariff for the 2024-29 tariff period for 400 kV S/C Kankroli-Jodhpur Transmission Line along with associated bays under “System Strengthening Scheme in South-Western Part of Northern Grid (Part-B)” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/219-TT-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff block for the transmission assets for Stage-1 of 400 kV Thyristor Controlled Series Compensation Project (Fact Device) on the Kanpur-Ballabgarh 400 kV S/C Line at Ballabgarh in the Northern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2019. Power Grid Corporation of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/195-TT-2025-Ors_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2014-19 tariff period and determination of transmission tariff for the 2019-24 tariff period in respect of 2 Number 765 kV line bays at 765/400 kV Raipur Pooling Station (Powergrid) for Raipur PS (Powergrid)-Rajnandgaon (TBCB) 765 kV D/C line under “Powergrid works associated with additional System Strengthening Scheme for Chhattisgarh IPPs (Part-B)” in the Western Region. Power Grid Corporation of India Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/30-TT-2021_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) read with Section 19 of the Electricity Act, 2003 read with Regulation 9, 19 and 20 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters) Regulations, 2020 seeking recovery of penalty for less return of power by the Respondents as per Banking Agreements executed between the Petitioner and the Respondents and seeking revocation of the inter-State trading license granted to Respondent No.1. Kreate Energy (I) Private Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/94-MP-2023_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act, 2003 for adjudication of disputes. Arunachal Pradesh Power Corp. Pvt. Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/265-MP-2022_160925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Grant of Transmission License to WRNES Talegaon Power Transmission Limited. WRNES Talegaon Power Transmission Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/678-TL-2025_160925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 and any other amendments thereon issued from time to time by this Commission, if any, for grant of Transmission Licence to Eastern Region Expansion Scheme-XXIX Power Transmission Limited. ERSS – XXXIX Power Transmission Limited (ERSS XXXIX).", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/513-TL-2024_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 along with Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking relief(s) against Central Transmission Utility of India Limited in connection with the in-principle grant of connectivity for 300 MW to the Petitioner herein at Davangere District in the State of Karnataka. Jade Hybren Private Limited, Layer Hybren Private Limited", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/371-MP-2024_160925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for declaration and direction as to the status of the 400 kV D/C Transmission Line from India Gandhi Super Thermal Power Station (Aravalli Power Station) to Daulatabad owned, operated, and maintained by Haryana Vidyut Prasaran Nigam Limited (HVPNL). Uttar Haryana Bijli Vitran Nigam Limited (UHBVNL) and Ors.", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/126-MP-2017_160825.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period for the Existing Transmission and Distribution System (excluding 400 kV lines). Damodar Valley Corporation", "date": "2025-09-16", "url": "https://cercind.gov.in/2025/ROP/655-TT-2025_100925.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to grant of Transmission License to POWERGRID Kurnool-IV Transmission Limited. POWERGRID Kurnool-IV Transmission Limited", "date": "2025-09-13", "url": "https://cercind.gov.in/2025/orders/470-TL-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79 and 178 of the Electricity Act, 2003 read with the CERC (Indian Electricity Grid Code) Regulations 2023, the CERC (Ancillary Services) Regulations, 2022, the CERC (Deviation Settlement Mechanism and Related Matters) Regulations, 2024, and Commission’s Suo-Motu Orders in 7/SM/2023 and 2/SM/2025 to secure reliable grid operation. GRID Controller of India Limited", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/713-MP-2025_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) & Section 94 of the Electricity Act, 2003 read with Regulations 74, 82, 111 & 112 of the CERC (Conduct of Business) Regulations, 1999 for considering unit and corresponding numerical value of water utilization for irrigation 'Q' from 'BM3' to 'MAFt' and Reservoir level of Omkareshwar Sagar Project at EL 192.97 M achieved on 4th October, 2017 & at EL 196.59 MW achieved on 5th November, 2019 in the tariff orders issued by the Commission from time to time. MPPMCL", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/220-MP-2022_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes on the issue of wrongful deduction of compensation towards alleged non-supply and non-submission of contract performance bank guarantee. Manikaran Power Limited", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/378-MP-2023_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes between the Petitioner and the Respondent and for direction for payment. DVC", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/319-MP-2019_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(c), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 read with Regulations 32, 33A and 32B of the Central Electricity Regulatory Commission (Grant of Connectivity, Long-Term Access and MediumTerm Open Access in inter-State transmission and related matters) Regulations, 2009 for inter-alia seeking to surrender Stage II Connectivity granted to the Petitioners without any adverse financial consequences, and relinquishment of long term access granted on existing inter-State transmission system to Petitioner No. 1 without any liability, on account of the occurrence of unavoidable, unforeseeable and uncontrollable events. Sprng Vayu Vidyut Private Limited & Anr.", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/67-MP-2021_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 111 and 113 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999, seeking directions to Southern Regional Power Committee to provide necessary information regarding intra-state transmission lines falling under Regulation 2 (1) (EE) Central Electricity Regulatory Commission (haring of inter-state transmission charges and losses) Regulations, 2020. Transmission Corporation of Andhra Pradesh Ltd.", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/183-MP-2021_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 seeking appropriate directions to CTUIL for allowing the conversion of the Connectivity granted under the Land-BG route to LOA/PPA route. Ganeko One Energy Private Limited and Anr.", "date": "2025-09-10", "url": "https://cercind.gov.in/2025/ROP/728-MP-2025_100925.pdf"}, {"type": "Current Regulation", "title": "1. Gazette", "date": "2025-09-09", "url": "https://cercind.gov.in/regulations/201-GAZ.pdf"}, {"type": "Record of Proceedings", "title": "Petition regarding the billing of energy charges by Pragati Power Corporation Limited in respect of its Pragati-III Combined Cycle Power Station (1371MW) located at Bawana, Delhi. PSPCL", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/410-MP-2024_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and for determination of tariff for the period 2024-29 in respect of the Kishanganga Power Station. NHPC Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/624-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff for the period 2024-29 in respect of NLCIL’s Barsingsar Thermal Power Station (BTPS) (250 MW) NLC India Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/622-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing-up of tariff of Tripura Gas Based Power Station (101 MW) of North-Eastern Electric Power Corporation Limited for the period 2019-24 and for the determination of tariff for the period 2024-29 NEEPCO", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/620-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for revision of tariff after the truing up exercise for the period 2019-24 and determination of tariff for the period 2024-29 in respect of Kopili Hydro Power Station (200 MW). NEEPCO Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/337-GT-2024_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for revision of tariff of Farakka Super Thermal Power Station Stage-III (500 MW) for the period 2019-24 after truing up exercise NTPC Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/79-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and for the determination of tariff for the period 2024-29 in respect of Kopili Hydroelectric Project Stage-II (25 MW). NEEPCO Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/47-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff for the period 2024-29 in respect of Mejia Thermal Power Station, Units 1, 2 & 3 (630 MW). DVC", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/626-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of true-up of tariff of 726.6 (2 x 363.3) MW Combined Cycle Gas Based Power Project at Palatana for the period 2019-24. OTPCL", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/628-GT-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Kurawar Transmission Limited to implement transmission project “Network expansion at 765/400/220kV Kurawar S/s for drawal of power by MPPTCL”. POWERGRID Kurawar Transmission Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/689-TL-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bhuj Transmission Limited to implement transmission project “Augmentation of transformation capacity” at Bhuj-II PS (GIS) & Provision of ICT Augmentation and Bus Reactor at Bhuj-II PS under “Regulated Tariff Mechanism” (RTM) Mode. POWERGRID Bhuj Transmission Limited", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/688-TL-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 read with Section 79(1)(c) of the Electricity Act, 2003 challenging the levy of relinquishment charges by PGCIL. Southern Power Distribution Co. of Telangana Ltd.", "date": "2025-09-09", "url": "https://cercind.gov.in/2025/ROP/85-MP-2021_090925.pdf"}, {"type": "What's New", "title": "Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) (Third Amendment) Regulations, 2025. Read more...", "date": "2025-09-09", "url": "https://cercind.gov.in/Current_reg.html"}, {"type": "Orders", "title": "Petition under Section 79(1)(a), 62 and 64 of the Electricity Act, 2003 read with Regulations 7 and 8 of the Central Electricity Regulatory Commission (Terms and Conditions for Tariff Determination from Renewable Energy Sources) Regulations, 2020 for determination of project specific tariff for 100 MW(AC)/155.02 MWp (DC) Solar PV power plant with 40MW/120 MWh of Battery Energy Storage at Rajnandgaon, Chhattisgarh for a period of 25 years from Commercial Operation Date (‘COD’) of the project. Solar Energy Corporation of India Limited", "date": "2025-09-08", "url": "https://cercind.gov.in/2025/orders/137-GT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Notice dated 04.09.2025 issued by Central Transmission Utility of India Limited to ReNew Green Energy Solutions Pvt. Ltd. and seeking directions against potential revocation of connectivity. ReNew Green Energy Solutions Pvt. Ltd. (RGESPL) & Anr.", "date": "2025-09-04", "url": "https://cercind.gov.in/2025/ROP/830-MP-2025_011025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulation 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Notice dated 04.09.2025 issued by Central Transmission Utility of India Limited to ReNew Green Energy Solutions Pvt. Ltd. and seeking directions against potential revocation of connectivity. ReNew Green Energy Solutions Pvt. Ltd. & Anr.", "date": "2025-09-04", "url": "https://cercind.gov.in/2025/ROP/830-MP-2025_260925.pdf"}, {"type": "Record of Proceedings", "title": "Implementation of APTEL judgement dated 04.09.2025 in appeal no 143 of 2020 and 66 of 2022 challenging the order of the CERC in Petition No. 305/MP/2015 dated 29.01.2020 and for directions against the Respondents to make Energy Charges as pass through based on the actual fuel cost incurred by the Petitioner. Adhunik Power and Natural Resources Limited", "date": "2025-09-04", "url": "https://cercind.gov.in/2025/ROP/305-MP-2015_180925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act 2003 read with Regulations 11A, 41 and 42 of the Central Electricity Regulatory Commission (General Network Access) Regulations 2022 (as amended from time to time), inter alia, seeking for quashing/ setting aside of the letter dated 03.09.2025 issued by the Central Transmission Utility of India Limited thereby revoking the 175 MW connectivity granted to the Petitioner under Regulation 11B(1) of the Central Electricity Regulatory Commission (General Network Access) (First Amendment) Regulations 2023. Airpower Windfarms Private Limited", "date": "2025-09-03", "url": "https://cercind.gov.in/2025/ROP/DY462-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act 2003 read with Regulations 11A, 41 and 42 of the Central Electricity Regulatory Commission (General Network Access) Regulations 2022 (as amended from time to time), inter-alia seeking for quashing/ setting aside of the letter dated 03.09.2025 issued by the Central Transmission Utility of India Limited thereby revoking the 175 MW connectivity granted to the Petitioner under Regulation 11B(1) of the CERC (General Network Access) (First Amendment) Regulations 2023. Airpower Windfarms Private Limited", "date": "2025-09-03", "url": "https://cercind.gov.in/2025/ROP/809-MP-2025_100925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for Adoption of Tariff discovered through Competitive Bidding Process for Supply of 1200 MW ISTS-Connected Solar PV Power Projects Anywhere in India with “Greenshoe Option” of Additional Capacity upto 600 MW. NTPC Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/735-AT-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for a direction to the Respondents to pay additional fixed charge of Rs.0.439/KWH for the balance period of PPA (Interlocutory Application for bringing on record additional documents) APEDCL & ors., GMR Vemagiri Power Generation Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/463-MP-2014_Ors.020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition regarding non-implementation of waiver of inter-State Transmission Charges for Renewable Energy Projects as envisaged by Ministry of Power in Billing of Designated Inter-State Transmission System Consumers under Central Electricity Regulatory Commission (Sharing of Inter-State Transmission Charges and Losses) Regulations, 2022 and its amendments. Kerala State Electricity Board Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/302-MP-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 and 178 of the Electricity Act, 2003 read with the CERC (Indian Electricity Grid Code) Regulations 2023, the CERC (Ancillary Services) Regulations, 2022, the CERC (Deviation Settlement Mechanism and Related Matters) Regulations, 2024, and Commission’s Suo-Motu Orders in 7/SM/2023 and 2/SM/2025 to secure reliable grid operation. GRID Controller of India Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/713-MP-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to MEL Power Transmission Limited. MEL Power Transmission Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/675-TL-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bikaner IV Transmission Limited to implement transmission project “Augmentation of 2x500 MVA (7th & 8th), 400/220 kV ICTs along with 220 kV Sectionalizer bay (1 set), 220 kV BC (1 no.) bay and 220 kV TBC (1 no.) bay at Bikaner-IV PS & Implementation of 3 nos. of 220 kV line bays for interconnection of M/s Furies Solren Private Limited (300MW) [1 no. bay] & M/s SJVN Green Energy Limited (500MW) [2 no. bays] RE power projects at 765/400/220kV Bikaner-IV PS under “Regulated Tariff Mechanism” (RTM) Mode. POWERGRID Bikaner IV Transmission Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/686-TL-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition for adjustment of capacity utilization, adjustment of tariff, extension of time for execution of project and other consequential reliefs. Aurum Renewable Energy Limited, KVK Energy Venture Private Limited, Diwakar Solar Projects Limited", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/41-MP-2014-Anr._020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Regulation 13 of the Central Electricity Regulatory Commission (Fees and Charges of Regional Load Despatch Centre and other related matters) Regulations, 2019 for truing up of WRLDC Fees and Charges for the 2019-24 control period. WRLDC, SRLDC, NLDC, ERLDC, NERLDC", "date": "2025-09-02", "url": "https://cercind.gov.in/2025/ROP/162-MP-2025_Ars._020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act 2003 read with Regulations 11A, 41 and 42 of the CERC (General Network Access) Regulations 2022 (and its subsequent amendments), inter-alia seeking for quashing/ setting aside of the letter dated 01.09.2025 issued by the Central Transmission Utility of India Limited (CTUIL) thereby revoking the connectivity of 1050 MW of the Petitioner under Regulation 11B(2) of the CERC (General Network Access) (Second Amendment) Regulations 2024, amongst other relief(s). Adani Green Energy Limited, Sarjan Realities Private Limited", "date": "2025-09-01", "url": "https://cercind.gov.in/2025/ROP/768-MP-2025_020925.pdf"}], "Grid India": []}, "state_map": {"Andhra Pradesh": [], "Arunachal Pradesh": [], "Assam": [], "Bihar": [], "Chhattisgarh": [], "Goa": [], "Gujarat": [], "Haryana": [], "Himachal Pradesh": [], "Jharkhand": [], "Karnataka": [], "Kerala": [], "Madhya Pradesh": [], "Maharashtra": [], "Manipur": [], "Meghalaya": [], "Mizoram": [], "Nagaland": [], "Odisha": [], "Punjab": [], "Rajasthan": [], "Sikkim": [], "Tamil Nadu": [], "Telangana": [], "Tripura": [], "Uttar Pradesh": [], "Uttarakhand": [], "West Bengal": []}, "ut_map": {"Andaman and Nicobar Islands": [], "Chandigarh": [], "Dadra and Nagar Haveli and Daman and Diu": [], "Delhi": [], "Jammu and Kashmir": [], "Ladakh": [], "Lakshadweep": [], "Puducherry": []}, "last_updated": "2025-10-08 11:22:40 IST"}