{"central_map": {"MoP": [], "MNRE": [], "MoF": [], "CEA": [], "CTUIL": [], "CERC": [{"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for the grant of a separate RTM Transmission Licence to POWERGRID Bhadla III Transmission Limited. POWERGRID Bhadla III Transmission Limited", "date": "2025-01-31", "url": "https://cercind.gov.in/2025/orders/437-TL-2024.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by Jamnagar Transmission Limited. Jamnagar Transmission Limited", "date": "2025-01-31", "url": "https://cercind.gov.in/2025/orders/423-AT-2024.pdf"}, {"type": "Orders", "title": "Petition under Section 63 read with Section 79(1)(k) of the Electricity Act, 2003 for the adoption of tariff for Long Term Procurement of Solar Power of 300 MW from Grid Connected Project under tariff Based Competitive Bidding for meeting Renewable Purchase Obligation (RPO) as per applicable regulations, which has been discovered through a transparent process by way of competitive bidding conducted in terms of the competitive bidding guidelines issued by the Ministry of Power. CESC Limited", "date": "2025-01-31", "url": "https://cercind.gov.in/2025/orders/365-AT-2024.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to POWERGRID Beawar-Mandsaur Transmission Limited. POWERGRID Beawar - Mandsaur Transmission Limited", "date": "2025-01-31", "url": "https://cercind.gov.in/2025/orders/324-TL-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act 2003 for adjudication of disputes between the Petitioner and the Respondent and for directions. DVC", "date": "2025-01-31", "url": "https://cercind.gov.in/2025/ROP/346-MP-2020_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the Asset under Transmission System associated with Teesta (Stage-V) HEP in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/99-TT-2025_290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 and Section 94 of the Electricity Act, 2003 read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 along with Regulation 65-68 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking issuance of appropriate order(s) /direction(s) in relation to 2×300 MW connectivity at Kurnool III Pooling Substation, State of Andhra Pradesh granted in favour of SAEL Industries Limited and consequent order(s). SAEL Industries Limited and Ors.", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/147-MP-2025_290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the “Assets under Tala-Siliguri Transmission System” in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/98-TT-2025_Anr._290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(c), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 read with Regulations 32, 33A and 32B of the Central Electricity Regulatory Commission (Grant of Connectivity, Long-Term Access and Medium Term Open Access in inter-State transmission and related matters) Regulations, 2009 for inter-alia seeking to surrender Stage II Connectivity granted to the Petitioners without any adverse financial consequences, and relinquishment of long term access granted on the existing inter-State transmission system to Petitioner No. 1 without any liability, on account of the occurrence of unavoidable, unforeseeable and uncontrollable events Sprng Vayu Vidyut Private Limited  and Anr.", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/67-MP-2021_290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(c) and 79(1)(k) of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access) Regulations, 2022 and Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 invoking this Commission’s Power to Relax and Power to Remove Difficulty to permit the inter-se utilisation and transfer of Connectivity and its associated rights between the Petitioner Nos. 2 and 3. Sprng Energy Private Limited and Ors.", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/438-MP-2024_290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and Section 79(1)(f) of the Electricity Act, 2003 seeking deferment of the operationalization date of 1000 MW Long Term Access granted to Adani Renewable Energy Park Rajasthan Limited by Central Transmission Utility to match with the completion and commissioning of Solar Park and exemption from liability of paying transmission charges until such time on account of force majeure events. Adani Renewable Energy Park Rajasthan Limited", "date": "2025-01-29", "url": "https://cercind.gov.in/2025/ROP/244-MP-2021_290125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79 (1)(f) and 79(1)(c) of the Electricity Act, 2003, read with Regulation 8 and Regulation 26 of the Central Electricity Regulatory Commission (Open Access in inter-State Transmission) Regulations, 2008 and Detailed Procedure framed thereunder and approved by this Commission, in relation to arbitrary, unlawful and mala fide acts on part of Respondent No.1, SLDC in refusing to process Petitioner’s Application for Standing Clearance for grant of Short Term Open Access (STOA) for August 2023 and grant the same within timelines stipulated in the Detailed Procedure. Tadas Wind Energy Private Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/223-MP-2023_280125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022. ACME Cleantech Solutions Private Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/259-MP-2024_280125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(a) & (f) of the Electricity Act, 2003, read with Regulation 65(1) of the CERC (Conduct of Business) Regulations, 2023. Power & Electricity Department, Mizoram", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/484-MP-2024_280125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval under Section 17 (3) and Section 17 (4) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of Transmission Licence and other related matters) Regulations, 2024for creation of security interest by way of hypothecation, charge or assignment over rights, title, interest, claims, demands, benefits under, clearance, project documents (except fixed assets), agreements and approvals of Kohima- Mariani Transmission Limited in favour of the Debenture Trustee, i.e., Axis Trustee Services Limited (Respondent No. 8) and for approval of documents creating security and of other documents in relation to the financing of the Transmission Project build, owned, operated and maintained by Kohima-Mariani Transmission Limited. Kohima-Mariani Transmission Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/429-MP-2024_280125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulation 57 and 58 of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking relaxation of the Regulation 43(9), Regulation 45(5)(a)(v) & 45(5)(a)(vi) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023. Damodar Valley Corporation", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/279-MP-2023_280125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 and its subsequent Clarification and replacement, if any, with respect to grant of Transmission License to Paradeep Transmission Limited. Paradeep Transmission Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/73-TL-2025_280125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Khavda V-A Power Transmission Limited. Khavda V-A Power Transmission Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/71-TL-2025_280125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Bikaner B Power Transmission Limited. Bikaner B Power Transmission Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/69-TL-2025_280125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 and its subsequent Clarification and replacement, if any, with respect to grant of Transmission License to Eastern Region Expansion Scheme -XXXIX Power Transmission Limited. ERES – XXXIX Power Transmission Limited", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/ROP/513-TL-2024_280125.pdf"}, {"type": "Schedule of Hearing", "title": "Advance Cause List Last modified: 28.01.2025 6:00PM", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/hearing_schedule/AV-JAN13.pdf"}, {"type": "Schedule of Hearing", "title": "Weekly Cause List Last modified: 28.01.2025 6:00PM", "date": "2025-01-28", "url": "https://cercind.gov.in/2025/hearing_schedule/WK-JAN10.pdf"}, {"type": "Orders", "title": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for 765 kV Single Circuit Kurnool-Raichur Transmission Line along with associated bay extensions at 765/400 kV Kurnool Sub-station and 765/400 kV Raichur Sub-station under the “System Strengthening Scheme-XXII” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. PGCIL", "date": "2025-01-27", "url": "https://cercind.gov.in/2025/orders/381.pdf"}, {"type": "Orders", "title": "Petition for determination of tariff of Khurja STPP (1320 MW) for the period from COD of Unit-I (26.1.2025) to 31.3.2029 and for the dedicated Transmission Line from Khurja STPP to Aligarh Sub-station from COD (26.1.2025) till 31.3.2029. THDC India Limited", "date": "2025-01-26", "url": "https://cercind.gov.in/2025/orders/475-GT-2025-I.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff of Khurja Super Thermal Power Plant (2x660 MW) for the period from COD of Unit-I i.e 26.1.2025 to 31.3.2029 and for Dedicated Transmission Line from Khurja STPP (2x660MW) to Aligarh Substation from Commercial Operation Date i.e. 26.1.2025 till 31.3.2029. THDC India Limited", "date": "2025-01-26", "url": "https://cercind.gov.in/2025/ROP/475-GT-2025_220725.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff of Khurja Super Thermal Power Plant (2x660 MW) for the period from COD of Unit-I i.e 26.1.2025 to 31.3.2029 and for Dedicated Transmission Line from Khurja STPP (2x660MW) to Aligarh Substation from Commercial Operation Date i.e. 26.1.2025 till 31.3.2029. THDC India Limited", "date": "2025-01-26", "url": "https://cercind.gov.in/2025/ROP/475.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of separate Transmission Licence for Augmentation of Transformation Capacity at KPS3 (GIS) S/s under Khavda Phase V Part B3 Scheme under Regulated Tariff Mechanism (RTM) route. Khavda IVA Power Transmission Limited", "date": "2025-01-25", "url": "https://cercind.gov.in/2025/ROP/61-TL-2025_280125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter- State Transmission System) Regulations, 2022 challenging Notices dated 24.1.2025 issued by Central Transmission Utility of India Limited to Serentica Renewables India 4 Private Limited and seeking directions against revocation of 200 MW connectivity. Serentica Renewables India 4 Private Limited", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/276-MP-2025_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003, read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations,2022 challenging Notices dated 24.01.2025 and 13.03.2025 issued by Central Transmission Utility of India Limited to Betam Wind Energy Private Limited revoking its Connectivity of 32 MW (Interlocutory application for interim reliefs). Betam Wind Energy Private Limited & Anr.", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/DY.212-2025_240425.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter- State Transmission System) Regulations, 2022 challenging Notices dated 24.1.2025 issued by Central Transmission Utility of India Limited to Serentica Renewables India 4 Private Limited and seeking directions against revocation of 200 MW connectivity. Serentica Renewables India 4 Private Limited", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/276-MP-2025_170425.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Notices dated 24.1.2025 issued by Central Transmission Utility of India Limited to Serentica Renewables India 4 Private Limited and seeking directions against revocation of 200 MW connectivity. Serentica Renewables India 4 Pvt. Ltd.", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/276-MP-2025_250325.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Notices dated 24.1.2025 issued by Central Transmission Utility of India Limited to Serentica Renewables India 4 Private Limited and seeking directions against revocation of 200 MW connectivity. Serentica Renewables India 4 Pvt. Ltd.", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/276-MP-2025_130325.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Notices dated 24.1.2025 issued by Central Transmission Utility of India Limited to Serentica Renewables India 4 Private Limited and seeking directions against revocation of 200 MW connectivity. Serentica Renewables India 4 Pvt. Ltd.", "date": "2025-01-24", "url": "https://cercind.gov.in/2025/ROP/276-MP-2025_270225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of project-specific tariff for 100 MW (AC)/ 155.02 MWp (DC) Solar PV power plant with 40/120 MWh of Battery Storage at Rajnandgao, Chhattisgarh for a period of 25 years from Commercial Operation Date (COD) of the project. Solar Energy Corporation of India Limited", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/137-GT-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 17(3) of the Electricity Act, 2003 seeking approval for sharing of corridor of 24.2 km of existing 400 k\tV S/C Kolar-Somanahally (Bangalore) Transmission Line with Karnataka Power Transmission Corporation Limited. Power Grid Corporation of India Limited", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/418-MP-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of transmission tariff for the 2019-24 period for new T&D Elements, namely, 1) Burdwan GIS 2) 220 kV D/C Parulia-Burdwan Transmission Line 3) 2 Nos. 220 kV bay at Parulia Sub-station, and 4) 4th Power Transformer at Durgapur Sub-station in respect of “New Element of Damodar Valley Corporation” in the Eastern Region. Damodar Valley Corporation", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/250-TT-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 94(1)(f) of the Electricity Act, 2003 read with Regulation 65, 66 and 68 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 Seeking compensation for loss of Capacity Charge on account of Inadequate availability of Fuel/Gas in terms of Regulation 76 (Power to Relax) of the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2019 in respect of the Tripura Gas based Power Station. NEEPCO", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/269-MP-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Rajasthan IV H1 Power Transmission Limited. Rajasthan IV H1 Power Transmission Limited", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/491-TL-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for amendment of existing RTM Transmission Licence to POWERGRID Bikaner Transmission System Limited to include transmission project \"Implementation of Bus Sectionalizer at 400 kV level of 400/220 kV Bikaner-II PS” and “Augmentation of Transformation Capacity at 400/220 kV Bikaner-II PS in Rajasthan by 400/220 kV, 1×500 MVA ICT (9th)”. POWERGRID Bikaner Transmission System Limited", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/487-TL-2024_230125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for amendment of existing RTM Transmission Licence to POWERGRID Ramgarh Transmission Limited to include transmission project “Augmentation of transformation Capacity at 400/220 kV Fatehgarh-III PS (Section-1) by 400/220 kV, 1×500 MVA ICT (5th)”. POWERGRID Ramgarh Transmission Limited", "date": "2025-01-23", "url": "https://cercind.gov.in/2025/ROP/486-TL-2024_230125.pdf"}, {"type": "Orders", "title": "Petition for revision of tariff of Muzaffarpur Thermal Power Station Stage-I (220 MW) for the period 2014-19, after the truing up exercise. Kanti Bijlee Utpadan Nigam Limited", "date": "2025-01-22", "url": "https://cercind.gov.in/2025/orders/264-GT-2021.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff of  the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset under Installation of Reactors in Western Region. Power Grid Corporation of India Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/orders/400-TT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 62 and 79(1)(a) of the Electricity Act, 2003 read with Regulation 29 of the CERC (Terms and Condition of Tariff) Regulations, 2019 for determination of tariff on installation of various Emission Control Systems in MTPS U#7&8 (1000 MW) of DVC in compliance of Revised Emission Standards. DVC", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/227-MP-2023_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of tariff of Nabinagar Super Thermal Power Station Stage-I (3x660 MW) for the period 2019-24. NTPC Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/2-GT-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act 2003 read with Regulation 7 (1) of Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations 2023 and Central Electricity Authority (Technical Standards for Connectivity to the Grid)) Regulations, 2007 and amendment thereof, seeking directions from the Hon'ble Commission to the Respondents regarding non-desirable performance of Inter-State Transmission System (ISTS) connected Renewable Energy (RE) Generating Stations during fault events leading to major generation loss and frequency dip and other associated matters. Northern Regional Load Despatch Centre", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/415-MP-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 17(3), read with Section 79 (1)(c), of the Electricity Act, 2003 seeking approval of the Commission for sale of the spare capacity of the optical ground wires (OPGW) owned by the Petitioners, grant of right of way for the transmission lines owned by the Petitioners for operation of such transferred OPGW to successful bidder and for installation and operation of additional OPGW, by successful bidder, at its own risk, reward and expense. Raipur Rajnandgaon-Warora Transmission Limited and 18 Others", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/411-MP-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Bhadla III Transmission Limited. Powergrid Bhadla III Transmission Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/437-TL-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for recovery of outstanding dues including Late Payment Surcharge, towards power supplied on Short Term basis. Adani Enterprise Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/239-MP-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 142 of the Electricity Act, 2003 and Regulation 70(2) of CERC (Conduct of Business) Regulations, 2023 read with Sections 42, 47 and Order XXI Rule 10 of Code of Civil Procedure Code, 1908 and read with Regulation 65 of CERC (Conduct of Business) Regulations, 2023 and Section 151 of Code of Civil Procedure Code, 1908 seeking execution/ enforcement/ compliance of the Commission’s earlier Orders (in Petition Nos. 160/GT/2012, 7/GT/2016 & 251/GT/2017). Adani Power Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/151-MP-2024_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for a  direction to the Respondents to pay additional fixed charge of  Rs.0.439/KWH for the balance period of PPA (Interlocutory  Application for bringing on record additional documents). APEDCL & ors, GMR Vemagiri Power Generation Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/463-MP-2014_210125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Regulation 54, 55 and 56 of Central Electricity Regulatory Commission (Power Market) Regulations, 2021 for seeking grant of additional time period for compliance of ownership structure of Petitioner in order to achieve the compliances set out under Regulation 15 of the Central Electricity Regulatory Commission (Power Market) Regulations, 2021. Power Exchange of India Limited", "date": "2025-01-21", "url": "https://cercind.gov.in/2025/ROP/413-MP-2024_210125.pdf"}, {"type": "Orders", "title": "Corrigendum to the order 20.1.2025 in Petition No. 349/TT/2023 - Approval under Regulation 86 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2014 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 for truing up of transmission tariff for the 2014-19 tariff period and determination of the transmission tariff for the 2019-24 tariff period for Assets under “Transmission System Associated with Parbati-III HEP” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/Corri-349-TT-2023.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for  the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Hassan-Mysore 400 kV D/C transmission line and extension of 400/220 kV Hassan and Mysore Sub-station under “System Strengthening-IX” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/399-TT-2024.pdf"}, {"type": "Orders", "title": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for Spare Converter Transformer for Vizag back to back HVDC terminal in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/394-TT-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Special Energy Meters in Southern Region. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/393-TT-2024.pdf"}, {"type": "Orders", "title": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for NCC Generation Switchyard to Nellore Pooling Station and associated bays under “Transmission System for Connectivity for NCC Power Projects Limited” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/377-TT-2024.pdf"}, {"type": "Orders", "title": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for provision of Spare ICTs and Reactors for the Southern Region forming part of provision of Spare ICTs and Reactors for Eastern, Northern, Southern and Western Regions under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1) (a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/356-TT-2024.pdf"}, {"type": "Orders", "title": "The Petition filed under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Bikaner Neemrana Transmission Limited.478-TL-2024_I POWERGRID Bikaner Neemrana Transmission Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/478-TL-2024_I.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for  truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of  the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for 2nd Spare Converter Transformers at Kolar and Talcher of Talcher-Kolar HVDC Link in Southern Region. Power Grid Corporation of India Limited", "date": "2025-01-20", "url": "https://cercind.gov.in/2025/orders/375-TT-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Thermal Powertech Corporation India Ltd. Switchyard to Nellore Pooling Station 400 kV D/C (quad) Line along with associated bay extensions at Nellore Pooling Station under “Transmission System for connectivity of Thermal Powertech Corporation India Ltd.” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-01-19", "url": "https://cercind.gov.in/2025/orders/397-TT-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of  the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for installation of 1X315 MVA 400/220 kV Autotransformer (ICT-III) along with associated bays at 400/220 kV Vapi (POWERGRID) Substation in Western Region. Power Grid Corporation of India Limited", "date": "2025-01-18", "url": "https://cercind.gov.in/2025/orders/401-TT-2024.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003, for the adoption of Transmission Charges with respect to the Transmission System being established by Navinal Transmission Limited. Navinal Transmission Limited", "date": "2025-01-18", "url": "https://cercind.gov.in/2025/orders/427-AT-2024.pdf"}, {"type": "Orders", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Jamnagar Transmission Limited. Jamnagar Transmission Limited", "date": "2025-01-18", "url": "https://cercind.gov.in/2025/orders/424-TL-2024_I.pdf"}, {"type": "Orders", "title": "Petition under Sections 14, 15, and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Navinal Transmission Limited. Navinal Transmission Limited", "date": "2025-01-18", "url": "https://cercind.gov.in/2025/orders/426-TL-2024-I.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Neemuch Transmission System Limited. POWERGRID Neemuch Transmission System Limited", "date": "2025-01-17", "url": "https://cercind.gov.in/2025/orders/477-TL-2024_I.pdf"}, {"type": "Orders", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 inter alia seeking relaxation of the conditions stipulated for submission of documents pertaining to Financial Closure Tata Power Renewable Energy Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/orders/503-MP-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under section 79(1)(f) of the Electricity Act, 2003 seeking quashing of invoices raised by the Respondent No. 1 on the Petitioner for being void, illegal and non-est, and seeking appropriate directions against the Respondent No. 1 to withdraw the invoices uploaded on the PRAAPTI portal and restraining it from issuing or uploading any further invoices on the said portal and from taking any coercive actions in furtherance of such invoices, including by way of seeking regulation of open access under the Electricity (Late Payment Surcharge and Related Matters) Rules, 2022. MSEDCL", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/276-MP-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of separate RTM Transmission Licence to POWERGRID Vataman Transmission Limited. POWERGRID Vataman Transmission Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/436-TL-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 along with Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking relief(s) against Central Transmission Utility of India Limited in connection with the in-principle grant of connectivity for 300 MW to the Petitioner herein at Davangere District in the State of Karnataka. Jade Hybren Private Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/371-MP-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(b) read with Section 79(1)(f) of the Electricity Act, 2003 seeking in-principle approval for installation of Flue Gas Desulphurisation (‘FGD’) in 2 x 270 MW Thermal Power Plant of Adhunik Power and Natural Resources Limited in compliance with Revised Emission Standards issued by the Ministry of Environment Forest and Climate Change as events of Change in Law. Adhunik Power & Natural Resources Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/364-MP-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking grant of Transmission License to NERGS-I Power Transmission Limited. NREGS-I Power Transmission Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/322-TL-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act read with Regulations 57 and 58 of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking relaxation in implementing Regulation 24(2) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 with respect to Unit 2 (350 MW) of Thermal Power Plant of the Petitioner at Sahajbahal, Jharsuguda in the State of Orissa. JSW Energy (Utkal) Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/82-MP-2025_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(c), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 read with Regulations 32, 33A and 32B of the Central Electricity Regulatory Commission (Grant of Connectivity, Long-Term Access and Medium Term Open Access in inter-State transmission and related matters) Regulations, 2009 for inter-alia seeking to surrender Stage II Connectivity granted to the Petitioners without any adverse financial consequences, and relinquishment of long term access granted on the existing inter-State transmission system to Petitioner No. 1 without any liability, on account of the occurrence of unavoidable, unforeseeable and uncontrollable events Sprng Vayu Vidyut Private Limited  and Anr.", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/67-MP-2021_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition regarding the billing of energy charges by Pragati Power Corporation Limited in respect of its Pragati-III Combined Cycle Power Station (1371MW) located at Bawana, Delhi. Punjab State Power Corporation Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/410-MP-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(a) & (f) of the Electricity Act, 2003 read with the applicable provisions of the CERC (Terms & Conditions of Tariff) Regulations, 2019. NTPC Ltd.", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/363-MP-2024_160125.pdf"}, {"type": "Record of Proceedings", "title": "Approval of Tariff of Barh Super Thermal Power Station Stage-II (1320 MW) for the period 2019-24. NTPC Limited", "date": "2025-01-16", "url": "https://cercind.gov.in/2025/ROP/74-GT-2024_160125.pdf"}, {"type": "Orders", "title": "Application under Section 14 and Section 15(1) of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020 for grant of an inter-state trading licence. REC Power Development & Consultancy Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/orders/281-TD-2024.pdf"}, {"type": "Orders", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of Transmission Licence with respect to the Transmission System to be implemented by Khavda IV C Power Transmission Limited. Khavda IV C Power Transmission Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/orders/340-TL-2024.pdf"}, {"type": "Orders", "title": "Petition under Sections 17(3) & 17(4) of Electricity Act, 2003 seeking approval for creation of security interest over all of the Petitioner’s Assets in favour of Respondent No. 2 (as the Security Trustee acting for the benefit of the Lender (as defined in the Petition) in respect of the Petitioner’s transmission project. KPS1 Transmission Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/orders/432-MP-2024.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of transmission charges with respect to the Transmission System being established by Bhadla-III & Bikaner-III Transmission Limited. POWERGRID Bhadla Bikaner Transmission Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/orders/342-AT-2024.pdf"}, {"type": "Orders", "title": "Petition under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to the Transmission Licence to POWERGRID Bhadla Bikaner Transmission Limited. POWERGRID Bhadla Bikaner Transmission Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/orders/343-TL-2024-F.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(b) and (f) read with Section 62 of the Electricity Act, 2003, seeking Specific Performance of agreement with Jammu and Kashmir State Power Development Corporation Limited. 303/MP/2023", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/303-MP-2023_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 29(5) of the Electricity Act, 2003 and 2.3.1(7) of the CERC (Indian Electricity Grid Code) Regulations, 2010, read with Regulation 65 of the CERC (Conduct of Business) Regulations, 2023. Powerica Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/330-MP-2024_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (b) read with Section 79(1) (f) of the Electricity Act, 2003 inter alia seeking reimbursement of the RLDC/ SLDC Charges from the Respondent and compensation on account of Change in Law event namely introduction of Composition User Fee. Adhunik Power and Natural Resources Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/329-MP-2024_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) for adjudication of dispute on the issue of Payment of Interest on Delayed Payment by the Respondent. Shree Cement Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/307-MP-2023_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (c) read with Section 79(1) (h) of the Electricity Act, 2003 read with Regulations 20 and 26 of the Central Electricity Regulatory Commission (Open Access in Inter-State Transmission) Regulations, 2009 read with Regulation 4 of the Rajasthan Electricity Regulatory Commission (Intra-State ABT) Regulations, 2006 and Regulation 4.2 of the Rajasthan State Grid Code, 2008 seeking refund of amounts paid for over-drawl against collective transactions. Rajasthan Steel Chambers", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/332-MP-2024_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition seeking directions to the Respondents for clearing the outstanding bills from August, 2011 to December, 2012 along with interest. NILE Limited", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/71-MP-2021_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(c), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 read with Regulations 32, 33A and 32B of the Central Electricity Regulatory Commission (Grant of Connectivity, Long-Term Access and Medium Term Open Access in inter-State transmission and related matters) Regulations, 2009 for inter-alia seeking to surrender Stage II Connectivity granted to the Petitioners without any adverse financial consequences, and relinquishment of long term access granted on the existing inter-State transmission system to Petitioner No. 1 without any liability, on account of the occurrence of unavoidable, unforeseeable and uncontrollable events Sprng Vayu Vidyut Private Limited and Anr.", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/67-MP-2021_140125.pdf"}, {"type": "Record of Proceedings", "title": "Review Petition under Section 94(1) (f) of the Electricity Act, 2003 read with Regulation 103 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and Order XLVII Rule 1 of the Code of Civil Procedure, 1908 Chhattisgarh State Power Distribution Co. Ltd.", "date": "2025-01-14", "url": "https://cercind.gov.in/2025/ROP/31-RP-2024_140125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(c) and (f) of the Electricity Act, 2003 read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter- State Transmission System) Regulations, 2022 and Central Electricity Regulatory Commission (Grant of Connectivity, Long- Term Access and Medium-term Open Access in Inter-State Transmission and Related Matters) Regulations, 2009. THDC India Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/Corri497-MP-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(c) and (f) of the Electricity Act, 2003 read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter- State Transmission System) Regulations, 2022 and Central Electricity Regulatory Commission (Grant of Connectivity, Long- Term Access and Medium-term Open Access in Inter-State Transmission and Related Matters) Regulations, 2009. THDC India Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/497-MP-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the South Olpad Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). South Olpad Transmission Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/493-AT-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Jam ' Khambhaliya Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Jam Khambhaliya Transmission Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/490-AT-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Rajasthan IV E Power Transmission Limited. Rajasthan IV E Power Transmission Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/313-TL-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63, 79(1) (c), 79(1)(d) and 79(1)(f) of the Electricity Act, 2003 read with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 seeking appropriate orders and directions concerning Section 63 transmission licensees to address issues relating to recovery of tariff, including the likely under-recovery of tariff, where the scheduled commercial operation date of transmission projects has been extended by the competent authority on account of uncontrollable events. Electric Power Transmission Association (EPTA) and Ors.", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/210-MP-2023_130125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) & 79(1)(f) of the Electricity Act, 2003 and all other enabling provisions. JSW Renew Energy Limited", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/42-MP-2024_130125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 to challenge the Respondents’ wrongful action of insisting upon additional requirements, which are contrary to contractual terms and provisions of the Power Purchase Agreement, for processing invoices and the communications of the Respondents calling upon solar/ wind power generators to obtain separate connections from Distribution Companies and avail power as per prevailing tariff category during the periods when their plant does not generate electricity. Solar Power Developers Association", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/41-MP-2023_130125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for declaration and direction as to the status of the 400 kV D/C Transmission Line from India Gandhi Super Thermal Power Station (Aravalli Power Station) to Daulatabad owned, operated, and maintained by Haryana Vidyut Prasaran Nigam Limited (HVPNL). Uttar Haryana Bijli Vitran Nigam Limited and Ors.", "date": "2025-01-13", "url": "https://cercind.gov.in/2025/ROP/126-MP-2017_130125.pdf"}, {"type": "Orders", "title": "Petition for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for a transmission asset under “Western Region System Strengthening Scheme-XIII (WRSS-XIII)” under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-11", "url": "https://cercind.gov.in/2025/orders/370-TT-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 and for Combined Asset comprising of Asset-I comprising of Combined Elements of: (a) 30% FSC on 400 kV Bareilly-Mandola Ckt. 1 and Ckt. 2 at Bareilly, (b) 45% FSC on 400 kV D/C Unnao-Bareilly Ckt. 1 and Ckt. 2 at Unnao and (c) 30% FSC on 400 kV Gorakhpur-Lucknow Ckt. 1 at Lucknow and Asset-II: 30% FSC on 400 kV Gorakhpur-Lucknow Ckt. 2 at Lucknow under “System associated with Enhancement of Transmission Capacity of East-West Corridor of the Northern Region”. Power Grid Corporation of India Limited", "date": "2025-01-11", "url": "https://cercind.gov.in/2025/orders/369-TT-2024.pdf"}, {"type": "Orders", "title": "Petition under Section 79 (1) (c) of the Electricity Act 2003, read with Regulations 41 and 42 of the CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022, and the relevant provisions of the Conduct of Business Regulations, 2023. Gujarat Energy Transmission Corporation Limited", "date": "2025-01-11", "url": "https://cercind.gov.in/2025/orders/434-MP-2024.pdf"}, {"type": "Current Regulation", "title": "1. Gazette", "date": "2025-01-11", "url": "https://cercind.gov.in/Regulations/181-GAZ.pdf"}, {"type": "Orders", "title": "Recovery of legacy dues in the Deviation Settlement Mechanism (DSM) Pool Account in pursuance of DSM Regulations, 2024 - Regarding.", "date": "2025-01-08", "url": "https://cercind.gov.in/2025/orders/01-SM-2025.pdf"}, {"type": "Orders", "title": "Approval for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for the Combined Asset under “System Strengthening–VIII in Southern Regional Grid” under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-08", "url": "https://cercind.gov.in/2025/orders/374-TT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 read with Section 38 of the Electricity Act, 2003 and Regulations 4.1 and 5.6 of Central Electricity Regulatory Commission (Connectivity and General Network Access to the Inter- State Transmission System) Regulations, 2022. Reliance Industries Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/95-IA-2024_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (b) and (f) of the Electricity Act 2003 seeking directions to Gujarat Urja Vikas Nigam Ltd. to make payment of certain amounts unilaterally deducted/ withheld from the Monthly Invoices and Debit Note/ Supplementary Invoices raised by JITPL Jindal India Thermal Power Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/203-MP-2024_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 challenging the Bills of Supply for Bilateral Charges raised by Central Transmission Utility of India Ltd. being contrary to the CERC (Sharing of Inter-State Transmission Charges and losses) Regulations, 2020 and CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 ReNew Solar Power Pvt. Ltd. & Anr.", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/111-MP-2024-Ors_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for assets under “System Strengthening Scheme in Roorkee in Northern Region”. Power Grid Corporation of India Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/4-TT-2025_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section-14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for Grant of separate Transmission License for Augmentation of 2x500 MVA, 400/230kV transformation capacity (3rd & 4th ICTs) at Karur PS and Implementation of 1 no. of 230kV line bay at Karur 400/230kV PS for interconnection of REGS of M/s Nannai Solar Park Pvt. Ltd. on Regulated Tariff Mechanism (RTM) route. Karur Transmission Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/225-AT-2024_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for Adoption of  Tariff discovered through Competitive Bidding Process for Setting up of 1200 MW ISTS-connected Solar PV Power Projects (Solar-2) Anywhere in India under Tariff-Based Competitive Bidding. SJVN Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/404-AT-2024_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the Combined Asset: 400 kV D/C Gorakhpur- Lucknow transmission line along with its associated bays; and 30% FSC on 400 kV D/C Gorakhpur-Lucknow transmission line at Lucknow along with bays under “Northern Region System Strengthening Scheme-X” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/453-TT-2024_Ors_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for Adoption of  Tariff discovered through Competitive Bidding Process for Setting up of 600 MW ISTS-connected Wind Power Projects (Wind-1) Anywhere in India under Tariff-Based Competitive Bidding. SJVN Limited", "date": "2025-01-07", "url": "https://cercind.gov.in/2025/ROP/420-AT-2024_070125.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of the transmission tariff of the Combined Assets of LILO of 400 kV S/C Vindhyachal-Korba transmission line and 400 kV D/C Gandhar-Hazira transmission line and 400/220 kV GIS Sub-station at Hazira and associated bays and 400 kV D/C Quad Moose transmission line from Mahan Thermal Power Plant-Sipat Pooling Sub-station and associated bays for the years 2012-13 and 2013-14 in the 2009-14 tariff period. Essar Power Transmission Company Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/33-RP-2016_Ors_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bikaner Neemrana Transmission Limited. POWERGRID Bikaner Neemrana Transmission Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/478-TL-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section79(1)(c), 79(1)(f) of the Electricity Act, 2003  read with Regulations 41, 42, 44 of the Central Electricity Regulatory Commission (Connectivity and Generation Network Access to the Inter-State Transmission System) Regulations, 2022 and amendments thereof read with Clause 56 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking deferment of effective date of General Network Access of 100 MW; alternatively, seeking additional 100 MW GNA through intra-State transmission system of State Transmission Utility connected to the ISTS till the completion of the commissioning of the overhead line by the Petitioner. India Power Corporation Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/350-MP-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of Transmission Charges with respect to Transmission System being established by Jamnagar Transmission Limited. Jamnagar Transmission Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/423-AT-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of Transmission Charges with respect to Transmission System being established by Navinal Transmission Limited. Navinal Transmission Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/427-AT-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Neemuch Transmission System Limite POWERGRID Neemuch Transmission System Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/477-TT-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulation 57 and 58 of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking relaxation of the Regulation 43(9), Regulation 45(5)(a)(v) & 45(5)(a)(vi) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023. Damodar Valley Corporation", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/279-MP-2023_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 66 of the Electricity Act, 2003 read with Regulation 25 of the Central Electricity Regulatory Commission (Power Market) Regulations, 2021 for approval of introduction of Green Real Time Market (G-RTM) at Indian Energy Exchange Ltd. Indian Energy Exchange Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/277-MP-2024_060125.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulation 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 and amendments thereof praying before this Hon’ble Commission to exercise its powers to “Remove Difficulty” arising out of the operation of the said Regulations. ReNew Surya Vihaan Private Limited", "date": "2025-01-06", "url": "https://cercind.gov.in/2025/ROP/35-MP-2024_060125.pdf"}, {"type": "Orders", "title": "Revision of tariff of Sipat Super Thermal Power Station, Stage-I (1980 MW) for the period 2009-14 and 2014-19- Implementation of the judgements of APTEL. NTPC Limited", "date": "2025-01-05", "url": "https://cercind.gov.in/2025/orders/337-GT-2014.pdf"}, {"type": "Orders", "title": "Revision of tariff of Korba Super Thermal Power Station, Stage-III (500 MW) for the periods 2009-14 and 2014-19- Implementation of the judgements of APTEL. NTPC Limited", "date": "2025-01-05", "url": "https://cercind.gov.in/2025/orders/340-GT-2014.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003 and under Regulation 15 (1) (a) and Regulation 23 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2019  and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2024 for Bhadrawati-Chandrapur 400 kV D/C transmission line including bays at Bhadrawati (Powergrid) Switching Station (Extensions) and Chandrapur (MSEB) Switchyard in Western Region. Power Grid Corporation of India Limited", "date": "2025-01-03", "url": "https://cercind.gov.in/2025/orders/382-TT-2024.pdf"}, {"type": "Orders", "title": "Approval for the truing-up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for the combined asset under “Transmission System associated with Contingency plan for evacuation of power from IL&FS (2x600 MW)” in Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-01-03", "url": "https://cercind.gov.in/2025/orders/358-TT-2024.pdf"}, {"type": "Orders", "title": "The Petition filed under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Bhadla III Transmission Limited. POWERGRID Bhadla III Transmission Limited", "date": "2025-01-03", "url": "https://cercind.gov.in/2025/orders/437-TL-2024_I.pdf"}, {"type": "Orders", "title": "Petition under Section 79 (1) (c), (f) and (k) of the Electricity Act, 2003 read with Regulation 41 & 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 for an appropriate decision on the submission of Payment on Order Instrument in lieu of Connectivity Bank Guarantee. Indosol Solar Private Limited", "date": "2025-01-03", "url": "https://cercind.gov.in/2025/orders/92-MP-2024.pdf"}, {"type": "Draft Regulation", "title": "6.Public hearing has been re-scheduled on 03.01.2025 at 10:30 AM.", "date": "2025-01-03", "url": "https://cercind.gov.in/2024/draft_reg/PH-Notice-03.01.2025.pdf"}, {"type": "Draft Regulation", "title": "7.Presentations of stakeholders during Hearing 03.01.2025", "date": "2025-01-03", "url": "https://cercind.gov.in/persentation-4thAmp_sharing2024.html"}, {"type": "Orders", "title": "Methodology for Transition from Six-Monthly Escalation Rates to Monthly Escalation Rates for Imported Coal.", "date": "2025-01-02", "url": "https://cercind.gov.in/2025/orders/10-SM-2024.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking transmission licence for Tumkur-II REZ Power Transmission Limited. Tumkur- II REZ Power Transmission Limited", "date": "2025-01-02", "url": "https://cercind.gov.in/2025/orders/347-TL-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 and truing up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of  the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for combined asset under Ramagundam Stage-III Transmission System in Southern Region. Power Grid Corporation of India Limited", "date": "2025-01-02", "url": "https://cercind.gov.in/2025/orders/383-TT-2024.pdf"}, {"type": "Orders", "title": "Approval of tariff of Farakka Super Thermal Power Station, Stage-III (500 MW) for the period 2014-19-Implementation of the judgments of APTEL NTPC Limited", "date": "2025-01-02", "url": "https://cercind.gov.in/2025/orders/280-GT-2014.pdf"}, {"type": "Orders", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for Pilot Projects of 500 MW/1000MWh Standalone Battery Energy Storage Systems in India under Tariff-Based Global Competitive Bidding (ESS-I) process as per the guidelines of the Government of India Solar Energy Corporation of India Limited", "date": "2025-01-02", "url": "https://cercind.gov.in/2025/orders/138-AT-2024.pdf"}], "Grid India": []}, "state_map": {"Andhra Pradesh": [], "Arunachal Pradesh": [], "Assam": [], "Bihar": [], "Chhattisgarh": [], "Goa": [], "Gujarat": [], "Haryana": [], "Himachal Pradesh": [], "Jharkhand": [], "Karnataka": [], "Kerala": [], "Madhya Pradesh": [], "Maharashtra": [], "Manipur": [], "Meghalaya": [], "Mizoram": [], "Nagaland": [], "Odisha": [], "Punjab": [], "Rajasthan": [], "Sikkim": [], "Tamil Nadu": [], "Telangana": [], "Tripura": [], "Uttar Pradesh": [], "Uttarakhand": [], "West Bengal": []}, "ut_map": {"Andaman and Nicobar Islands": [], "Chandigarh": [], "Dadra and Nagar Haveli and Daman and Diu": [], "Delhi": [], "Jammu and Kashmir": [], "Ladakh": [], "Lakshadweep": [], "Puducherry": []}, "last_updated": "2025-10-08 11:25:33 IST"}