{"central_map": {"MoP": [], "MNRE": [], "MoF": [], "CEA": [], "CTUIL": [], "CERC": [{"type": "Orders", "title": "Petition under Section 62 read with Section 79 of the Electricity Act, 2003 along with Regulations 111-113 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999, for determination of the transmission tariff of the deemed inter-State transmission lines owned by West Bengal State Electricity Transmission Company Limited with the transmission system operated by Central Transmission Utility of India Limited, for inclusion in PoC transmission charges for the period FY 2019-20 to FY 2023-24 under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019. West Bengal State Electricity Transmission Company Limited", "date": "2025-05-31", "url": "https://cercind.gov.in/2025/orders/324-TT-2023.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by the Bidar Transco Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Bidar Transco Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/orders/351-AT-2025.pdf"}, {"type": "Orders", "title": "Petition under Section 17(1) and 17(3) of Electricity Act, 2003 for amalgamation/merger of POWERGRID Bhadla-III Transmission Limited, POWERGRID Ramgarh-II Transmission Limited, POWERGRID Beawar Dausa Transmission Limited, POWERGRID Bikaner Neemrana Transmission Limited, POWERGRID Sikar Khetri Transmission Limited, and POWERGRID Vataman Transmission Limited and assignment/ transfer of transmission licences pursuant to amalgamation/merger. 1. POWERGRID BHADLA III Transmission Limited, 2. POWERGRID RAMGARH II Transmission Limited, 3. POWERGRID Beawar Dausa Transmission Limited, 4. POWERGRID Bikaner Neemrana Transmission Limited, 5. POWERGRID Sikar Khetri Transmission Limited, 6. POWERGRID Vataman Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/orders/500-MP-2024.pdf"}, {"type": "Orders", "title": "Petition under Section 17 (1) and 17(3) of Electricity Act, 2003 (‘the Act’) for amalgamation/merger of Powergrid Khavda II-B Transmission Limited, Powergrid Khavda RE Transmission System Limited, Powergrid KPS2 Transmission System Limited, Powergrid KPS3 Transmission Limited, Powergrid ERWR Power Transmission Limited, Powergrid Raipur Pool Dhamtari Transmission Limited, Powergrid Dharamjaigarh Transmission Limited, Powergrid Bhadla Sikar Transmission Limited, Powergrid Ananthpuram Kurnool Transmission Limited, Powergrid Neemrana Bareilly Transmission Limited, Powergrid Koppal Gadag Transmission Limited, Powergrid Bidar Transmission Limited and Powergrid Khavda II-C Transmission Limited and assignment/ transfer of Transmission Licences pursuant to amalgamation/merger. 1.\tPOWERGRID KHAVDA II-B Transmission Limited, 2.\tPOWERGRID KHAVDA RE Transmission System Limited, 3.\tPOWERGRID KPS2 Transmission System Limited and others", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/orders/439-MP-2024.pdf"}, {"type": "Orders", "title": "Petition under Sections 17(3) & 17(4) of the Electricity Act, 2003 seeking approval for creation of security interest over all of the Petitioner’s Assets in favour of Respondent No.2, (as the Security Trustee acting for the benefit of the Lender) in respect of the Petitioner’s Transmission Project. Khavda IV C Power Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/orders/311-MP-2025.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period under Section 62 read with Section 79(1)(d) of Electricity Act, 2003 and under the Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Condition of Tariff Regulations) 2019 and the Central Electricity Regulatory Commission (Terms and Condition of Tariff Regulations) 2024 for the Asset under “Eastern Region Strengthening Scheme-XXIV (ERSS-XXIV)” in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/orders/21-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Chitradurga Bellary REZ Transmission Limited. Chitradurga Bellary REZ Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/468-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Kurnool-IV Transmission Limited. Kurnool-IV Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/470-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of Transmission tariff for 2019-24 and determination of transmission tariff for 2024-29 tariff block for Asset-I: 50 MVAR Line Reactor at Jaipur (South) in 400 kV D/C Kota - Jaipur (South) line (Part of 400 kV D/C RAPP- Jaipur TL) utilized as Bus Reactor at Jaipur (South) Sub-station and Asset-II: 400 kV D/C Kota - Jaipur (South) line along with associated bays at Kota and Jaipur (South) (Part of RAPP-Jaipur (S) 400 kV D/C line with one Ckt LlLO at Kota) under Transmission System associated with RAPP 7 & 8, Part B, in Northern Region. Power Grid Corporation of India Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/196-TT-2025Ors_300525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for Madurai-Trivandrum 400 kV D/C Transmission System in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/272-TT-2025Ors_300525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of Transmission Tariff for 2019-24 and determination of Transmission Tariff for 2024-29 tariff block for 400 kV line bays at Bhiwani Sub-station for termination of 400 kV Babai-Bhiwani D/C Line under Provision of 400 kV Line bays at Bhiwani (PG) in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/187-TT-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Banaskantha Transco Limited. Banaskantha Transco Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/472-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Rajasthan V Power Transmission Limited. Rajasthan V Power Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/466-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Kurnool III PS RE Transmission Limited. Kurnool III PS RE Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/464-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of transmission charges with respect to the transmission system to be implemented by Anantapur II REZ Transmission Limited (subsidiary of Resonia Limited). Anantapur II REZ Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/463-TL-2025_300525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Transmission License to Fatehgarh II and Barmer I PS Transmission Limited. Fatehgarh II and Barmer I PS Transmission Limited", "date": "2025-05-30", "url": "https://cercind.gov.in/2025/ROP/460-TL-2025_300525.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of the transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Assets under “Northern Region System Strengthening Scheme-XXV” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/198-TT-2025.pdf"}, {"type": "Orders", "title": "Petition under Sections 14 & 15 of the Electricity Act, 2003, read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024, with respect to Transmission License to Bidar Transco Limited. Bidar Transco Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/352-TL-2025_I.pdf"}, {"type": "Orders", "title": "Petition under Section 79 of the Electricity Act, 2003, read with Section 38 and Regulations 4.1, 5.6 and 17.1(iii) of the General Network Access Regulations, 2022, thereby imploring this Hon’ble Commission to exercise its regulatory powers, for the purpose of facilitating the Petitioner to obtain General Network Access for the Petitioner’s Petrochemical Plant located at Dahej, Gujarat at the DGEN Switchyard and DGEN dedicated Transmission Line of Torrent Power Limited. M/s. Reliance Industries Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/246-MP-2024.pdf"}, {"type": "Orders", "title": "Petition under Section 79(1)(c) and 79(1)(f) of the Electricity Act, 2003 read with Regulation 65 of the CERC (Conduct of Business) Regulations, 2023 and Section 151 of the Code of Civil Procedure, 1908 seeking issuance of directions to CTUIL to grant of final connectivity to the Petitioners. 1. ReNew Solar Power Private Limited, 2. Renew Dinkar Jyoti Private Limited, 3. Renew Solar (Shakti Three) Private Limited, 4. Renew Solar (Shakti Five) Private Limited, 5. Renew Samir Shakti Private Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/140-MP-2024.pdf"}, {"type": "Orders", "title": "Petition under Section 79(1)(f) read with Sections 79(1)(c) & (d), 38, 39, 40, and 60 of the Electricity Act, 2003 concerning the unjust, arbitrary and illegal terms imposed by Himachal Pradesh Power Transmission Corporation Limited and Allain Duhangan Hydro Power Limited for transmission of power by the Petitioner on inter-state transmission lines operated by them. Kanchanjunga Power Company Private Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/124-MP-2017.pdf"}, {"type": "Orders", "title": "Petition under Sections 79(1) (c) and (f) of the Electricity Act, 2003 read with Regulations 27, 33A and 33B of the CERC (Grant of Connectivity, Long-Term Access and Medium-Term Open Access in inter-State Transmission and related matters) Regulations, 2009, seeking recognition of force majeure events and issuance of appropriate orders. Amp Energy Green Private Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/66-MP-2023.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003 and under Regulation 15 (1) (a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for truing up of Transmission Tariff for 2019-24 and determination of Transmission Tariff for 2024-29 tariff block for Combined Asset under “System Strengthening - XII” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/orders/391-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and for determination of tariff for the period 2024-29 in respect of Tehri Hydroelectric Power Project Stage-I (4x250MW). THDC India Ltd", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/511-GT-2024_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff for assets under “Eastern Region Strengthening Scheme – XXII” in Eastern Region. Power Grid Corporation of India Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/396-TT-2024Ors_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period in respect of the transmission assets under the  “400 kV Palatana-Bongaigaon Transmission System Project” in the North Eastern Region implemented by the North East Transmission Company Limited. North East Transmission Company Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/383-TT-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by Khavda V-B1B2 Power Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Khavda V-B1B2 Power Transmission Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/349-AT-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking Transmission License for Bijapur REZ Transmission Limited. Bijapur REZ Transmission Ltd.", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/247-TL-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for 400 kV Bawana – Mandaula Double Ckt. and 400 kV Bamnauli – Ballabhgarh Double Ckt. transmission lines under Section 62 read with Section 79 of Electricity Act, 2003, and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Delhi Transco Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/343-TT-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of the capital cost and transmission tariff pertaining to FY 2024-25 to FY 2028-29 for One spare unit (1-Ph) 80 MVAR reactor at 765 kV Warangal New Sub-station Transmission system constructed, maintained and operated by Warora Kurnool Transmission Limited vide Licence No.  79/Transmission/2022/CERC. Warora Kurnool Transmission Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/102-TT-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of the Annual Transmission Charges for the 2019-24 tariff period and approval of the Annual Transmission Charges for the 2024-29 tariff period for the Combined Transmission Asset consisting of (i) 400 kV Double Circuit Siliguri-Purnea Transmission Line, 400 kV Double Circuit Purnea-Muzaffarpur Transmission Line and 220 kV Double Circuit Muzaffarpur (PGCIL)-Muzaffarpur (BSEB) Transmission Line, in the Eastern Region; (ii) 400 kV Double Circuit Muzaffarpur-Gorakhpur Transmission Line in the Eastern-Northern Inter-region; and (iii) 400 kV Double Circuit Gorakhpur-Lucknow Transmission Line and 400 kV Double Circuit Bareilly-Mandola Transmission Line, in the Northern Region associated with Tala HEP of Powerlinks Transmission Limited. Powerlinks Transmission Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/143-TT-2025_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for revision of transmission tariff for 2001-04, 2004-09 and 2009-14 tariff periods, truing up of transmission tariff for the 2014-19 tariff period and determination of transmission tariff for the2019-24 tariff period for Asset-I: 800 kV Kishenpur-Moga transmission line-I along with associated bays; Asset-II: 800 kV Kishenpur-Moga transmission line-II along with associated bays; and Asset-III: 420 kV 63 MVAR Bus Reactor at Kishenpur Sub-station with associated bays and 420/220 kV, 250 MVA ICT III at Moga Sub-station with associated bays for Transmission System associated with Kishenpur Moga Transmission System in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-05-29", "url": "https://cercind.gov.in/2025/ROP/482-TT-2019_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 in respect of Uri-I Power Station and for determination of tariff for the period 2024-29 in respect of Uri-I Power Station. NHPC", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/474-GT-2025_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019 and for determination of tariff for the period 2024-29 in respect of Salal Power Station. NHPC", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/129-GT-2025_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 in respect of Chamera-I Power Station and for determination of tariff for the period 2024-29 in respect of Chamera-I Power Station. NHPC", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/46-GT-2025_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of tariff for 2024-29 period for Simhadri Super Thermal Power Station Stage-I (1000 MW). NTPC Limited", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/40-GT-2025_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of tariff for the period 2019-24 and for determination of tariff for the period 2024-29, in respect of Agartala Gas Based Power Station. NEEPCO", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/39-GT-2025_270525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff on installation of various Emission Control Systems at Vindhyachal Super Thermal Power Station Stage-IV (1000MW) in compliance with Revised Emission Standards. NTPC Ltd", "date": "2025-05-27", "url": "https://cercind.gov.in/2025/ROP/367-GT-2024_270525.pdf"}, {"type": "Orders", "title": "Petition under Sections 79(1)(c), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 read with Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business Regulations), 2023 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access) Regulations, 2022 seeking exercise of this Hon’ble Commission’s “Power to Relax” and “Power to Remove Difficulty” inter alia, seeking appropriate reliefs pertaining to compliance by way of submitting financial closure documents. 1. ACME Solar Holdings Limited, 2.\tACME Raisar Solar Energy Private Limited, 3.\tACME Phalodi Solar Energy Private Limited, 4.\tACME Deoghar Solar Power Private Limited, 5.\tACME Dhaulpur Powertech Private Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/319-MP-2025.pdf"}, {"type": "Orders", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 and its subsequent Clarification and amendments, if any, with respect to grant of Transmission License to Lakadia B Power Transmission Limited. Lakadia B Power Transmission Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/300-TL-2025_I.pdf"}, {"type": "Orders", "title": "Petition under Section 63 of Electricity Act, 2003 seeking adoption of the Transmission Charges for the “Transmission system for Augmentation of transformation capacity at 765/400 kV Lakadia S/s (WRSS XXI(A) Transco Ltd.) in Gujarat Part B” being established by the Petitioner. Lakadia B Power Transmission Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/299-AT-2025.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by Rajasthan Part I Power Transmission Limited. Rajasthan Part I Power Transmission Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/253-AT-2025.pdf"}, {"type": "Orders", "title": "Petition Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to Transmission License to POWERGRID Koppal Gadag Augmentation Transmission Limited, (erstwhile Gadag II and Koppal II Transmission Limited). POWERGRID Koppal Gadag Augmentation Transmission Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/251-TL-2025-I.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by the Gadag II and Koppal II Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). POWERGRID Koppal Gadag Augmentation Transmission Limited", "date": "2025-05-26", "url": "https://cercind.gov.in/2025/orders/250-AT-2025.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to transmission licence to POWERGRID South Olpad Transmission Limited. POWERGRID South Olpad Transmission Limited", "date": "2025-05-24", "url": "https://cercind.gov.in/2025/orders/494-TL-2024_I.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of Transmission Charges with respect to the Transmission System being established by the South Olpad Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). POWERGRID South Olpad Transmission Limited", "date": "2025-05-24", "url": "https://cercind.gov.in/2025/orders/493-AT-2024.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to transmission Licence to Rajasthan IV 4A Power Transmission Limited. Rajasthan IV 4A Power Transmission Limited,", "date": "2025-05-24", "url": "https://cercind.gov.in/2025/orders/237-TL-2025-I.pdf"}, {"type": "Orders", "title": "Application under Section 63 of the Electricity Act, 2003 for the adoption of transmission charges with respect to the Transmission System being established by the Rajasthan IV 4A Power Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). POWERGRID Ghiror Transmission Limited", "date": "2025-05-24", "url": "https://cercind.gov.in/2025/orders/236-AT-2025.pdf"}, {"type": "Orders", "title": "Application under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020. DHARA POWER", "date": "2025-05-24", "url": "https://cercind.gov.in/2025/orders/362-TD-2025_I.pdf"}, {"type": "Orders", "title": "Petition under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Grant of Transmission License to Rajasthan Part I Power Transmission Limited. Rajasthan Part I Power Transmission Limited", "date": "2025-05-23", "url": "https://cercind.gov.in/2025/orders/252-TL-2025-I.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 under the Central Electricity Regulatory Commission  (Terms and Conditions of Tariff) Regulations, 2019  and determination of the transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for transmission asset 400/220/33 kV, 500 MVA ICT-4 along with associated bays at Amritsar (PG) Sub-station under Additional 1X500 MVA, 400/220 kV (4th) transformer at Amritsar (Balachak) Sub-station under ISTS. Power Grid Corporation of India Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/orders/205-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking grant of Transmission License to NERGS-I Power Transmission Limited. NERGS-I Power Transmission Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/322-TL-2024_290525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 challenging the repeated revision in energy charges claimed by NTPC in relation to supply of power from the Farakka Super Thermal Power Station. WBSEDCL", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/111-MP-2021_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for recovery of outstanding dues including Late Payment Surcharge, towards power supplied on Short Term basis. Adani Energy Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/239-MP-2024_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) & 79(1)(f) of the Electricity Act, 2003 and all other enabling provisions. JSW Renew Energy Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/42-MP-2024_220525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 79(1) (f) of the Electricity Act, 2003 seeking adjudication of dispute with NTPC limited in respect of its National Thermal Power Plant Stage-II, Dadri. BRPL", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/366-MP-2022_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022. ACME Cleantech Solutions Private Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/259-MP-2024_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 29(5) of the Electricity Act, 2003 read with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999. Gujarat Industries Power Company Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/126-MP-2024_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 17(3) and 17(4) of the Electricity Act, 2003 for the creation of security interest over the Petitioner’s Assets in favour of the Respondent No.15 as the Debenture Trustee acting for the benefit of the Debenture Holders. Mumbai Urja Marg Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/309-MP-2025_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act, 2003. Avaada Energy Private Limited", "date": "2025-05-22", "url": "https://cercind.gov.in/2025/ROP/240-MP-2024_220525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 66 of the Electricity Act, 2003 read with Regulation 25 of the Central Electricity Regulatory Commission (Power Market) Regulations, 2021 for approval of introduction of Green Real Time Market (G-RTM) at Indian Energy Exchange Ltd. Indian Energy Exchange Limited", "date": "2025-05-21", "url": "https://cercind.gov.in/2025/ROP/277-MP-2024_210525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003, seeking payment of outstanding dues towards Late Payment Surcharge on account of delay in reimbursement of Transmission Charges paid by MB Power (Madhya Pradesh) Limited to Powergrid Corporation of India Ltd., on behalf of the Respondents. MB Power (Madhya Pradesh) Limited", "date": "2025-05-21", "url": "https://cercind.gov.in/2025/ROP/359-MP-2025_210525.pdf"}, {"type": "Record of Proceedings", "title": "Truing up application under Regulation 13 of the Central Electricity Regulatory Commission (Fees and Charges of Regional Load Despatch Centre and other related matters) Regulations, 2019 for truing up of WRLDC Fees and Charges for the 2019-24 control period. Western Regional Load Despatch Centre, National Load Despatch Centre, Southern Regional Load Despatch Centre, Eastern Regional Load Despatch Centre, Northern Regional Load Despatch Centre, North Eastern Regional Load Despatch Centre", "date": "2025-05-21", "url": "https://cercind.gov.in/2025/ROP/162-MP-2025_210525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under section 79(f) of the Electricity act, 2003 seeking direct the Respondent No.1 to pay an amount of Rs.19,05,31,515/ - (Rupees Nineteen Crores Five lacs thirty -one Thousand five Hundred Fifteen Only) to the Petitioner. Jindal Saw Limited", "date": "2025-05-21", "url": "https://cercind.gov.in/2025/ROP/321-MP-2025_210525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under section 79 (1) (a) and (f) of the Electricity Act, 2003, read with relevant provisions of the CERC (Sharing of Inter-State Transmission Charges and Losses) Regulations, 2020 and amendments thereof regarding wrongful levy of transmission deviation charges on injection of infirm power from Parbati-II HEP 800 MW project. NHPC Limited", "date": "2025-05-21", "url": "https://cercind.gov.in/2025/ROP/315-MP-2025_210525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with the other applicable provisions of the Electricity Act, 2003 as amended from time to time as regards the unauthorized deductions made by the Respondents from the bills payable to the Petitioner. Reliance Infrastructure Limited, A.P. Power Coordination Committee and 5 others", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/455-MP-2019_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Regulation 44(6), (7) & (8) of the CERC (Terms and Conditions of Tariff) Regulations, 2019 for recovery of un-recovered energy charges due to shortfall in energy generation for reasons beyond the control of generating station during 2018-19 in respect of Karcham Wangtoo HEP. JSW Hydro Energy Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/184-MP-2019_200525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of a separate Transmission Licence to Mumbai Urja Marg Limited for implementation of an ISTS Project under RTM Route. Mumbai Urja Marg Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/428-TL-2025_200525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Grant of Transmission Licence to Jamnagar Transmission Limited. Jamnagar Transmission Limited, Navinal Transmission Limited, ERSS – XXXIX Power Transmission Limited, Paradeep Transmission Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/424-TL-2024_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 seeking extension of timelines of Connectivity and LTA for its Solar Power Project at Nokh Solar Park. Rajasthan Solar Park Development Co. Ltd.", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/104-MP-2022_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the combined asset associated with “Western Region Strengthening Scheme VI” in the Western Region. Power Grid Corporation of India Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/26-TT-2025_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of transmission tariff for the 2019-24 period for new T&D Elements, namely, 1) Burdwan GIS 2) 220 kV D/C Parulia-Burdwan Transmission Line 3) 2 Nos. 220 kV bay at Parulia Sub-station, and 4) 4th Power Transformer at Durgapur Sub-station in respect of “New Element of Damodar Valley Corporation” in the Eastern Region. Damodar Valley Corporation", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/250-TT-2024_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Mundra I Transmission Limited. Mundra I Transmission Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/441-TL-2025_200525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024, seeking grant of Transmission Licence for Ratle Kiru Power Transmission Limited. Ratle Kiru Power Transmission Limited", "date": "2025-05-20", "url": "https://cercind.gov.in/2025/ROP/433-TL-2025_200525.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for Asset-1: Conversion of existing 2x63 MVAR line reactors at Bhachau end of Bhachau- EPGL 400 kV D/C line to Switchable Line Reactor along with Western Region Strengthening Scheme – 21 and Asset-2: 1 No. 220 kV GIS Line bays at Bhuj Substation associated with Part-B: Extension works at Bhuj Pooling Station for interconnection of RE projects in the Western Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/orders/57-TT-2025.pdf"}, {"type": "Orders", "title": "Petition under Section 79 of the Electricity Act, 2003 seeking a declaration that no State Transmission Charges and Losses can be imposed upon the Petitioner towards the supply of power to M/s MPSEZ Utilities Limited, amongst other reliefs. Adani Power Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/orders/263-MP-2023.pdf"}, {"type": "Orders", "title": "Petition under Section 19 of the Electricity Act, 2003 read with Regulation 20 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of Trading Licence and other related matters) Regulations, 2020 inter alia seeking punitive action against and revocation of trading license of M/s Kreate Energy (I) Pvt. Ltd. Uttarakhand Power Corporation Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/orders/306-MP-2022.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(b) and 79(1)(f) of the Electricity Act, 2003 inter alia seeking recovery of compensation illegally and wrongfully deducted by PTC India Limited from the Petitioner qua alleged non-supply of power from the period commencing from February, 2012 to May, 2012. Bharat Aluminium Company Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/617-MP-2020_190525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for amendment of existing RTM Transmission License to POWERGRID Bikaner Transmission System Limited to include transmission project “Augmentation of transformation capacity at 400/220kV Bikaner-II PS in Rajasthan by 1x500 MVA, 400/220 kV ICT (10th)”. POWERGRID Bikaner Transmission System Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/444-TL-2025_190525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for amendment of existing RTM Transmission License to POWERGRID Bikaner Neemrana Transmission Limited to include transmission project “Augmentation of transformation capacity at 765/400/220kV Bikaner-III PS in Rajasthan by 1x500 MVA, 400/220kV ICT (6th)”. POWERGRID Bikaner Neemrana Transmission Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/442-TL-2025_190525.pdf"}, {"type": "Record of Proceedings", "title": "Petition seeking exercise of Power to Remove Difficulty and Power to relax under Regulation 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 as read with Section 79 of the Electricity Act, 2003 and Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023. Bhakra Beas Management Board", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/395-MP-2025_190525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Bidar Transco Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Bidar Transco Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/351-AT-2025_190525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by Pune – III Transmission Limited. Pune – III Transmission Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/75-AT-2025-Anr._190525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) read with Section 79(1)(f) of the Electricity Act, 2003, and applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 and the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 seeking revision of Effective Date of 100 MW General Network Access granted in favour of Petitioner. Hindalco Industries Limited", "date": "2025-05-19", "url": "https://cercind.gov.in/2025/ROP/83-MP-2025_190525.pdf"}, {"type": "Orders", "title": "Petition under Section 63 read with Section 79, including Section 79(1)(c) and (d) of the Electricity Act, 2003 seeking adoption of the transmission charges payable by Central Transmission Utility of India Ltd./ Respondent No. 1 for implementation of the Transmission Scheme for integration of Bijapur REZ in Karnataka by the Petitioner. Bijapur REZ Transmission Limited", "date": "2025-05-15", "url": "https://cercind.gov.in/2025/orders/248-AT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulation 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 challenging Show Cause Notices dated 15.05.2025 (received on 16.05.2025) issued by Central Transmission Utility of India Limited to ReNew Green Energy Solutions Private Limited and seeking directions against potential revocation of connectivity. ReNew Green Energy Solutions Private Limited & Ors.", "date": "2025-05-15", "url": "https://cercind.gov.in/2025/ROP/783-MP-2025_260925.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003, read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024, seeking Transmission License for Bijapur REZ Transmission Limited. Bijapur REZ Transmission Limited", "date": "2025-05-14", "url": "https://cercind.gov.in/2025/orders/247-TL-2025_I.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking grant of Transmission License to NERGS-I Power Transmission Limited. NERGS-I Power Transmission Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/orders/322-TL-2024_I.pdf"}, {"type": "Orders", "title": "Petition under Section 63 of the Electricity Act, 2003 seeking adoption of Transmission Tariff discovered pursuant to tariff based competitive bidding with respect to development and operation of “North-Eastern Region Generation Scheme-I (NERGS-I). NERGS-I Power Transmission Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/orders/319-AT-2024.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for Combined Assets under “Transmission System associated with Substation works associated with System Strengthening in the Southern Region for Import of Power from Eastern Region” in the Southern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/orders/19-TT-2025.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 tariff period in respect of the  Combined Assets under Powergrid works associated with “TBCB lines under common transmission system for Phase-II generation projects in Odisha” in the Eastern & Western Regions under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003 and under Regulation 15 (1) (a) and Regulation 23 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/orders/17-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020 for grant of an inter-state trading licence. Clean Renewable Energy Hybrid Fifteen Private Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/443-TD-2025130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff discovered through Competitive Bidding Process for Supply of 1200 MW Firm and Dispatchable Power (FDRE – 2) from ISTS-Connected Renewable Energy (RE) Power Projects with Energy Storage System with “Greenshoe Option” of additional capacity upto 1200 MW. SJVN Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/312-AT-2025_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79  of the Electricity Act, 2003 read with Regulations 111 and 113 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999, seeking directions to Southern Regional Power Committee to provide necessary information regarding intra-state transmission lines falling under Regulation 2 (1) (EE) Central Electricity Regulatory Commission (sharing of inter-state transmission charges and losses) Regulations, 2020. Transmission Corporation of Andhra Pradesh Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/183-MP-2021_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulations 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 seeking relaxation of the conditions stipulated for submissions of land documents under Regulation 5.8(xi)(b). Oyster Renewable Energy Private Limited and Anr., Avaada Energy Private Limited and Anr.", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/453-MP-2025_130525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020. Dhara Power", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/362-TD-2025_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act 2003 for adjudication of disputes between the Petitioner and the Respondent and for directions. Damodar Valley Corporation", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/346-MP-2020_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 62 and 79(1)(a) of the Electricity Act, 2003 read with Regulation 29 of the CERC (Terms and Condition of Tariff) Regulations, 2019 for determination of tariff on installation of various Emission Control Systems in MTPS U#7&8 (1000 MW) of DVC in compliance of Revised Emission Standards. Damodar Valley Corporation", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/227-MP-2023_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 66 of the Electricity Act, 2003 read with the Regulation 25 of the Central Electricity Regulatory Commission (Power Market) Regulations, 2021 for approval of introduction of Green RTM and High Price RTM on the Petitioner’s PRATYAY Platform. Power Exchange India Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/446-MP-2025_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1) of the Electricity Act, 2003 read with CERC (Conduct of Business) Regulations, 2023 in relation to refund of the excess amount of Rs. 2,51,55,786/- towards the Transmission and SLDC charges along with 18% interest to EID Parry’s Power Plant at Kakinada (On admission). Parry Sugars Refinery India Private Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/337-MP-2025_130525.pdf"}, {"type": "Record of Proceedings", "title": "Petition seeking approval for lignite input price for the 2019-24  in respect of Pooled Neyveli Mines as per CERC (Terms and Conditions of Tariff) Second Amendment, Regulations 2021. NLC India Limited", "date": "2025-05-13", "url": "https://cercind.gov.in/2025/ROP/223-MP-2022_130525.pdf"}, {"type": "Draft Regulation", "title": "2.Public Notice 3.Draft Notification 4.Explanatory Memorandum 5.Comments 6.Public hearing will be held on 09.05.2025 at 10:30 AM. 7.Presentations of stakeholders during Hearing 09.05.2025", "date": "2025-05-09", "url": "https://cercind.gov.in/2024/draft_reg/PNA.pdf"}, {"type": "Draft Regulation", "title": "3.Draft Notification", "date": "2025-05-09", "url": "https://cercind.gov.in/2024/draft_reg/DNA.pdf"}, {"type": "Draft Regulation", "title": "4.Explanatory Memorandum", "date": "2025-05-09", "url": "https://cercind.gov.in/2024/draft_reg/EMA.pdf"}, {"type": "Draft Regulation", "title": "5.Comments", "date": "2025-05-09", "url": "https://cercind.gov.in/comments-CBTE(2nd-amnd)2024.html"}, {"type": "Draft Regulation", "title": "6.Public hearing will be held on 09.05.2025 at 10:30 AM.", "date": "2025-05-09", "url": "https://cercind.gov.in/2025/draft_reg/PH_CBTE_2024.pdf"}, {"type": "Draft Regulation", "title": "7.Presentations of stakeholders during Hearing 09.05.2025", "date": "2025-05-09", "url": "https://cercind.gov.in/presentations-CBTE(2nd-amnd)2024.html"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(k) of the Electricity Act, 2003, read with Regulation 19(3) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) (First Amendment) Regulations, 2024, seeking extension of infirm power injection for 100 MW Solar component out of the SECI 600 MW Hybrid Project. TP Saurya Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/301-MP-2025_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(a) & (f) of the Electricity Act, 2003 read with the applicable provisions of the CERC (Terms & Conditions of Tariff) Regulations, 2019. NTPC Ltd.", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/363-MP-2024_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of tariff of Nabinagar Super Thermal Power Station Stage-I (3x660 MW) for the period 2019-24. NTPC Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/2-GT-2024_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Regulation 86 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and Regulation 25 of Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 seeking approval for establishment of Transmission Line Stores along with associated infrastructure for 400 kV D/C Teesta-III-Kishanganj Transmission Line of Sikkim Power Transmission Limited (formerly Teestavalley Power Transmission Limited). Sikkim Power Transmission Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/267-MP-2024_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) &(f) of the Electricity Act, 2003 read with Regulation 65 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023. TP Saurya Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/358-MP-2023_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(f) read with Section 79(1)(k) of the Electricity Act, 2003 along with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 seeking appropriate reliefs with regard to extension of scheduled commission date and stay of any coercive measures. Khandukhal Rampura Transmission Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/325-MP-2024_080525.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Gadag II and Koppal II Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Gadag II and Koppal II Transmission Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/250-AT-2025_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(d) of the Electricity Act, 2003 read with Regulation 3(9)(a) and 8(5)(ii) of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2014 and Regulation 3(10)(a) of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019. Powerlinks Transmission Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/254-MP-2023_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes on the issue of wrongful deduction of compensation towards alleged non-supply and non-submission of contract performance bank guarantee. Manikaran Power Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/378-MP-2023_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (b) and (f) of the Electricity Act 2003 seeking directions to Gujarat Urja Vikas Nigam Ltd. to make payment of certain amounts unilaterally deducted/ withheld from the Monthly Invoices and Debit Note/ Supplementary Invoices raised by JITPL Jindal India Thermal Power Limited", "date": "2025-05-08", "url": "https://cercind.gov.in/2025/ROP/203-MP-2024_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition for declaration and direction as to the status of the 400 kV D/C Transmission Line from India Gandhi Super Thermal Power Station (Aravalli Power Station) to Daulatabad owned, operated, and maintained by Haryana Vidyut Prasaran Nigam Limited (HVPNL). Uttar Haryana Bijli Vitran Nigam Limited (UHBVNL) and Ors", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/126-MP-2017_080525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) read with Section 19 of the Electricity Act, 2003 read with Regulation 9, 19 and 20 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters) Regulations, 2020 seeking recovery of penalty for less return of power by the Respondents as per Banking Agreements executed between the Petitioner and the Respondents and seeking revocation of the inter-State trading license granted to Respondent No.1. Kreate Energy (I) Private Limited, Arunachal Pradesh Power Corp. Pvt. Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/94-MP-2023_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for a direction to the Respondents to pay additional fixed charge of Rs.0.439/KWH for the balance period of PPA (Interlocutory Application for bringing on record additional documents). APEDCL & ors., GMR Vemagiri Power Generation Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/463-MP-2014_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 17(3) & 17(4) of the Electricity Act, 2003 seeking approval for creation of security interest over all of the Petitioner’s Assets in favour of Respondent No.2, (as the Security Trustee acting for the benefit of the Lender) in respect of the Petitioner’s Transmission Project. Khavda IV C Power Transmission Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/311-MP-2025_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of Electricity Act, 2003 seeking adoption of Transmission Charges of Rs. 596.21 million up to the validity of TSA for the “Transmission system for Augmentation of transformation capacity at 765/400 kV Lakadia S/s (WRSS XXI(A) Transco Ltd.) in Gujarat Part B” being established by the Petitioner. Lakadia B Power Transmission Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/299-AT-2025_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Regulation 1.5(iv) read with Regulation 5.2(u) and Regulation 6.5 (11) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2010 read with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 seeking direction to State Load Dispatch Centre to implement the Must Run station accorded to the Petitioner’s Solar Project in letter and spirit and compensate the Petitioner for the unlawful and arbitrary curtailment of generation from the Petitioner's Solar Project. Solairepro Urja Private Limited (", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/592-MP-2020_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for 600 MW inter-state Transmission System connected Wind- Solar Hybrid Power Projects and selected through competitive bidding process (SECI ISTS IX) as per the Guidelines of the Government of India. Solar Energy Corporation of India Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/242-AT-2025_070525.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 read with Section 79(1)(k) of the Electricity Act, 2003 for adoption of tariff for Long Term Procurement of 300 MW Power from Grid Connected Wind-Solar Hybrid Project under tariff Based Competitive Bidding for meeting Renewable Purchase Obligation (RPO) as per applicable regulations, which has been discovered through a transparent process by way of a competitive bidding conducted in terms of the competitive bidding guidelines issued by the Ministry of Power. CESC Limited", "date": "2025-05-07", "url": "https://cercind.gov.in/2025/ROP/241-AT-2025_070525.pdf"}, {"type": "Orders", "title": "Application under Sections 14 and Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters), Regulations, 2020 for grant of an inter-state trading license. Visan Infrastructure Private Limited", "date": "2025-05-05", "url": "https://cercind.gov.in/2025/orders/498-TD-2024.pdf"}, {"type": "Orders", "title": "Petition for and on behalf of the Petitioner under section 79(1)(f) of the Electricity Act, 2003 BSES Yamuna Power Limited", "date": "2025-05-05", "url": "https://cercind.gov.in/2025/orders/174-MP-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of the transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for determination of the transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for Asset-I: 400 kV D/C Lara STPS-I to Raigarh (Kotra) Pooling Station Transmission Line along with associated bays at Raigarh (Kotra) Pooling Station and Asset-II: 400 kV D/C (Quad) Lara STPS-I - Champa Transmission Line along with associated bays at Champa Pooling Station under “Transmission System associated with Lara STPS-I (2x800 MW) Generation Project of NTPC” in the Western Region. Power Grid Corporation of India Limited", "date": "2025-05-02", "url": "https://cercind.gov.in/2025/orders/184-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for  truing-up of the transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for determination of the transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for controlling High Loading of Nellore (PG)-Nellore PS 400 kV (Quad) D/C line” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-05-01", "url": "https://cercind.gov.in/2025/orders/457-TT-2024.pdf"}], "Grid India": []}, "state_map": {}, "ut_map": {}, "last_updated": "2025-10-09 11:49:03 IST"}