{"central_map": {"MoP": [], "MNRE": [], "MoF": [], "CEA": [], "CTUIL": [], "CERC": [{"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to POWERGRID Kurawar Transmission Limited (erstwhile Rajasthan IV H1 Power Transmission Limited) . POWERGRID Kurawar Transmission Limited", "date": "2025-02-28", "url": "https://cercind.gov.in/2025/orders/491.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1) (b) and (f) of the Electricity Act 2003 seeking directions to Gujarat Urja Vikas Nigam Ltd. to make payment of certain amounts unilaterally deducted/ withheld from the Monthly Invoices and Debit Note/ Supplementary Invoices raised by JITPL. JITPL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/203.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(b) and 79(1)(f) of the Electricity Act, 2003 inter alia seeking recovery of compensation illegally and wrongfully deducted by PTC India Limited from the Petitioner qua alleged non-supply of power from the period commencing from February, 2012 to May, 2012. BALCO.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/617.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79, including Sections 79 (1)(c), 79 (1)(f) and 79 (1)(k) of the Electricity Act, 2003 seeking direction upon Respondents to allow the said Petitioner to convert and continue its old connectivity under the new regime without the need of applying for GNA. BALCO.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/192.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 seeking extension of timelines of Connectivity and LTA for its Solar Power Project at Nokh Solar Park. RSDCL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/104M.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System “Transmission system for evacuation of power from Rajasthan REZ Ph-IV (Part-4: 3.5 GW): Part B” being established by Rajasthan IV 4B Power Transmission Limited. Rajasthan IV 4B Power Transmission Limited.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/176.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003, read with Section 38 and Regulations 4.1, 5.6 and 17.1(iii) of the General Network Access Regulations, 2022, thereby imploring this Commission to exercise its regulatory powers, for the purpose of facilitating the Petitioner to obtain General Network Access for the Petitioner’s Petrochemical Plant located at Dahej, Gujarat at the DGEN Switchyard and DGEN dedicated Transmission Line of Torrent Power Limited. RIL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/246.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 including Section 79(1)(b), 79(1)(f) and 79(1)(k) of the Electricity Act, 2003 for seeking recovery of (i) delayed payment interest towards failure of the Respondent No. 1 to pay the invoices/ bills for supply of power within the stipulated contractual timeframe; and (ii) compensation along with interest towards failure of the Respondent No. 1 to off-take the minimum quantum of power in terms of the short-term contracts for the relevant period. ITPCL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/61.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Navinal Transmission Limited. NTL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/426.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Grant of Transmission Licence to Jamnagar Transmission Limited. JTL.", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/424.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes on the issue of wrongful deduction of compensation towards alleged non-supply and non-submission of contract performance bank guarantee. Manikaran Power Limited .", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/378.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of tariff of Nabinagar Super Thermal Power Station Stage-I (3x660 MW) for the period 2019-24. NTPC Limited  .", "date": "2025-02-27", "url": "https://cercind.gov.in/2025/ROP/2.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for amendment of the existing RTM Transmission Licence to POWERGRID Ramgarh Transmission Limited to include transmission project “Augmentation of transformation Capacity at 400/220 kV Fatehgarh-III PS (Section-1) by 400/220 kV, 1×500 MVA ICT (5th)” . POWERGRID Ramgarh Transmission Limited", "date": "2025-02-26", "url": "https://cercind.gov.in/2025/orders/486.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79 (1) (d) of the Electricity Act, 2003 and under  Regulation 15 (1) (a) and Regulation 23 of Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Condition of Tariff) Regulations, 2024 for the Combined Asset under “Southern Region System Strengthening Scheme-XVIII” in the Southern Region. PGCIL", "date": "2025-02-26", "url": "https://cercind.gov.in/2025/orders/354.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Assets under Hathidah River Crossing Section of 220 kV Biharsharif-Begusarai Transmission Line in the Eastern Region. PGCIL", "date": "2025-02-26", "url": "https://cercind.gov.in/2025/orders/481.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the “Special Protection Scheme (SPS) for Northern Regional Grid Stage-II” in the Northern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/orders/157-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 10, 41 and 42 of the CERC (Connectivity and General Network Access to the inter State Transmission System) Regulations, 2022 seeking deferment of the Start, Date of the Hindustan Zinc Limited’s 250 MW GNARE intimated vide notices dated 25.2.2025 and 25.3.2025 issued by Central Transmission Utility of India Limited, and quashing of the Central Transmission Utility of India Limited's notice dated 23.4.2025 and the National Load Despatch Centre's Notification of Transmission charges payable by DICs for Billing Month of May, 2025 dated 28.4.2025 imposing arbitrary and illegal financial liabilities. Hindustan Zinc Limited", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/584-MP-2025_011025.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 10, 41 and 42 of the CERC (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 seeking deferment of the Start Date of the Hindustan Zinc Limited’s 250 MW GNARE intimated vide notices dated 25.02.2025 and 25.03.2025 issued by Central Transmission Utility of India Limited, and quashing of the Central Transmission Utility of India Limited’s notice dated 23.04.2025 and the National Load Despatch Centre’s Notification of Transmission charges payable by DICs for Billing Month of May, 2025 dated 28.04.2025 imposing arbitrary and illegal financial liabilities. Hindustan Zinc Limited", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/584-MP-2025_090925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with Regulations 10, 41 and 42 of the CERC (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 seeking deferment of the Start Date of the Hindustan Zinc Limited’s 250 MW GNARE intimated vide notices dated 25.02.2025 and 25.03.2025 issued by Central Transmission Utility of India Limited, and quashing of the Central Transmission Utility of India Limited’s notice dated 23.04.2025 and the National Load Despatch Centre’s Notification of Transmission charges payable by DICs for Billing Month of May, 2025 dated 28.04.2025 imposing arbitrary and illegal financial liabilities (Interlocutory application bringing on record subsequent developments, and seeking interim relief and urgent listing). Hindustan Zinc Limited", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/584-MP-2025_120825.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 17 (1) and 17(3) of Electricity Act, 2003 (‘the Act’) for amalgamation/merger of Powergrid Khavda II-B Transmission Limited, Powergrid Khavda RE Transmission System Limited, Powergrid KPS2 Transmission System Limited, Powergrid KPS3 Transmission Limited, Powergrid ERWR Power Transmission Limited, Powergrid Raipur Pool Dhamtari Transmission Limited, Powergrid Dharamjaigarh Transmission Limited, Powergrid Bhadla Sikar Transmission Limited, Powergrid Ananthpuram Kurnool Transmission Limited, Powergrid Neemrana Bareilly Transmission Limited, Powergrid Koppal Gadag Transmission Limited, Powergrid Bidar Transmission Limited and Powergrid Khavda II-C Transmission Limited and assignment/ transfer of Transmission Licences pursuant to amalgamation/merger. POWERGRID Khavda II-B Transmission Limited & 12 Ors.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/439.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(f) read with Section 79(1)(k) of the Electricity Act, 2003 along with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 seeking appropriate reliefs with regard to extension of scheduled commission date and stay of any coercive measures. KRTL.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/325.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 63 of Electricity Act, 2003 seeking adoption of Transmission Charges of Rs. 2,561.83 million per annum up to the validity of TSA for the “Transmission system for evacuation of power from “EASTERN REGION EXPANSION SCHEME-XXXIV (ERES-XXXIV)” being established by the Petitione. PTL.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/74.pdf"}, {"type": "Record of Proceedings", "title": "Petition under section 17 (1) and 17(3) of electricity act, 2003 for amalgamation/merger of POWERGRID Bhadla III Transmission Limited, POWERGRID Ramgarh II Transmission Limited, POWERGRID Beawar Dausa Transmission Limited, POWERGRID Bikaner Neemrana Transmission Limited, POWERGRID Sikar Khetri Transmission Limited and POWERGRID Vataman Transmission Limited and assignment/ transfer of transmission licences pursuant to amalgamation/merger. POWERGRID Bhadla III Transmission Limited & 5 Ors.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/500.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 142 of the Electricity Act, 2003 and Regulation 70(2) of CERC (Conduct of Business) Regulations, 2023 read with Sections 42, 47 and Order XXI Rule 10 of Code of Civil Procedure Code, 1908 and read with Regulation 65 of CERC (Conduct of Business) Regulations, 2023 and Section 151 of Code of Civil Procedure Code, 1908 seeking execution/ enforcement/ compliance of the Commission’s earlier Orders (in Petition Nos. 160/GT/2012, 7/GT/2016 & 251/GT/2017). Adani Power Limited .", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/151.pdf"}, {"type": "Record of Proceedings", "title": "Petition for determination of tariff for 400 kV Uravakonda-Veltoor-I and II, 400 kV Kamavarapukota-Suryapet-I and II lines for the FY 2019-20 to FY 2023-24. Transmission Corporation of Andhra Pradesh Limited.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/104.pdf"}, {"type": "Record of Proceedings", "title": "Petition for true up from the COD to FY 2018-19 and determination of tariff for the 2019-24 for “400 kV Sub-station Srinagar” (Asset-1: 400/220 kV 02x03x105 ICT, 220/132 kV 02x160 MVA ICT along with bays and Asset-2: 1X80 MVAR Reactor) (Deemed ISTS) under UITP Scheme. Power Transmission Corporation of Uttarakhand Limited.", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/186.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 of “Additional Special Energy Meters” in Northern Region. PGCIL .", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/ROP/450.pdf"}, {"type": "Schedule of Hearing", "title": "Advance Cause List Last modified: 25.02.2025 6:00PM", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/hearing_schedule/AV-FEBV13.pdf"}, {"type": "Schedule of Hearing", "title": "Weekly Cause List Last modified: 25.02.2025 6:00PM", "date": "2025-02-25", "url": "https://cercind.gov.in/2025/hearing_schedule/WK-FEBV10.pdf"}, {"type": "Orders", "title": "Application under Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 (1) Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading licence and other related matters) Regulations, 2020 for the grant of a trading licence. KVK Energy & Infrastructure Private Limited", "date": "2025-02-24", "url": "https://cercind.gov.in/2025/orders/84-TD-2025.pdf"}, {"type": "Orders", "title": "Petition under Section 79 of the Electricity Act read with Regulations 57 and 58 of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 seeking relaxation in implementing Regulation 24(2) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2023 with respect to Unit 2 (350 MW) of Thermal Power Plant of the Petitioner at Sahajbahal, Jharsuguda in the State of Orissa. JSW Energy (Utkal) Limited", "date": "2025-02-24", "url": "https://cercind.gov.in/2025/orders/82-MP-2025_I.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 read with Regulation 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 (as amended) and Connectivity Sharing Agreement dated 24.02.2025 entered between Halvad Renewables Private Limited and Azure India Private Limited for seeking limited modification of in principle grant of connectivity issued by Central Transmission Utility of India for 130 MW at Gadag Pooling Station and thereby allowing the Petitioner to construct the dedicated transmission infrastructure. Halvad Renewables Private Limited", "date": "2025-02-24", "url": "https://cercind.gov.in/2025/ROP/429-MP-2025_020925.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1 )(f) of the Electricity Act, 2003 read with Regulation 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 (as amended) and Connectivity Sharing Agreement dated 24.02.2025 entered between Halvad Renewables Private Limited and Azure India Private Limited for seeking limited modification of in principle grant of connectivity issued by Central Transmission Utility of India for 130 MW at Gadag Pooling Station and thereby allowing the Petitioner to construct the dedicated transmission infrastructure. Halvad Renewables Private Limited", "date": "2025-02-24", "url": "https://cercind.gov.in/2025/ROP/429-MP-2025_290725.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1 )(f) of the Electricity Act, 2003 read with Regulation 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter-State Transmission System) Regulations, 2022 (as amended) and Connectivity Sharing Agreement dated 24.02.2025 entered between Halvad Renewables Private Limited and Azure India Private Limited for seeking limited modification of in principle grant of connectivity issued by Central Transmission Utility of India for 130 MW at Gadag Pooling Station and thereby allowing the Petitioner to construct the dedicated transmission infrastructure Halvad Renewables Private Limited", "date": "2025-02-24", "url": "https://cercind.gov.in/2025/ROP/429-MP-2025_240625.pdf"}, {"type": "Orders", "title": "Petition for the truing up of transmission tariff for the 2019-24 period and the determination of transmission tariff for the 2024-29 period for an asset under “Fixed Series Compensation on 400 kV lines” in the  Southern Region under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-02-21", "url": "https://cercind.gov.in/2025/orders/38-TT-2025.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to transmission Licence to Jam Khambhaliya Transmission Limited. POWERGRID Jam Khambhaliya Transmission Limited", "date": "2025-02-21", "url": "https://cercind.gov.in/2025/orders/489-TL-2024_I.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Vataman Transmission Limited. POWERGRID Vataman Transmission Limited", "date": "2025-02-21", "url": "https://cercind.gov.in/2025/orders/436-TL-2024.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for grant of separate Transmission Licence for Augmentation of Transformation Capacity at KPS3 (GIS) S/s under Khavda Phase-V Part B3 Scheme under Regulated Tariff Mechanism (RTM) route. Khavda IVA Power Transmission Limited", "date": "2025-02-21", "url": "https://cercind.gov.in/2025/orders/61-TL-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Assets under LILO of Purnea-Dalkola 132 kV S/C line and extension at Purnea (PG) Sub-station in Eastern Region. Power Grid Corporation of India Limited", "date": "2025-02-20", "url": "https://cercind.gov.in/2025/orders/480-TT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(a) of the Electricity Act, 2003 read with Regulation 57 and 58 of the Central Electricity Regulatory Commission (India Electricity Grid Code), 2023 and Regulation 102 and 103 of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. NTPC", "date": "2025-02-20", "url": "https://cercind.gov.in/2025/ROP/113.pdf"}, {"type": "Record of Proceedings", "title": "Application under Regulation-44(6) of CERC (Terms and Conditions of Tariff) Regulations, 2019 for recoupment of under-recovered energy charges due to shortfall in energy generation for reasons beyond the control of generating station during the FY 2021-22 in respect of Chutak Power Station. NHPC Limited", "date": "2025-02-20", "url": "https://cercind.gov.in/2025/ROP/264-MP-2024_200225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for adoption of Transmission Charges with respect to Transmission System Being established by the Rajasthan IV H1 Power Transmission Limited. Rajasthan IV H1 Power Transmission Limited", "date": "2025-02-20", "url": "https://cercind.gov.in/2025/ROP/492-AT-2024_190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 challenging the repeated revision in energy charges claimed by NTPC in relation to the supply of power from the Farakka Super Thermal Power Station. WBSEDCL.", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/111.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(k) of the Electricity Act, 2003 read with Regulation 13(11) of the Central Electricity Regulatory Commission (Sharing of Inter-State Transmission Charges and Losses) Regulations, 2020, Procedure No. 5.12 of NLDC’s Procedure for Computation and sharing of Inter-State Transmission System Charges and Regulations 111 to 113 & 115 of the Central Electricity Regulatory Commission (Conduct of Business Regulations), 1999 seeking diection NLDC to implement the provisions of Sharing Regulations, 2020 and detailed procedure and exclude the quantum of TANGEDCO’s share in CGS drawn through State network from the total LTA of TANGEDCO considered for computation of ISTS charges and losses. TANGEDCO.", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/319.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 read with the other applicable provisions of the Electricity Act, 2003 as amended from time to time as regards the unauthorized deductions made by the Respondents from the bills payable to the Petitioner. Reliance Infrastructure Limited, A.P. Power Coordination Committee and 5 others", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/455-MP-2019_190225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 seeking grant of Transmission License to NERGS-I Power Transmission Limited. NERGS-I Power Transmission Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/322-TL2-024_190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 63, 79(1) (c), 79(1)(d) and 79(1)(f) of the Electricity Act, 2003 read with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 seeking appropriate orders and directions concerning Section 63 transmission licensees to address issues relating to recovery of tariff, including the likely under-recovery of tariff, where the scheduled commercial operation date of transmission projects has been extended by the competent authority on account of uncontrollable events. Electric Power Transmission Association and 6 Ors.", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/210-MP-2023_190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act, 2003 read with Section 79(1)(c) of the Electricity Act, 2003 challenging the levy of relinquishment charges by PGCIL. Southern Power Distribution Co. of Telangana Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/85-MP-2021_190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) of the Electricity Act, 2003 read with Regulation 41 and 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 seeking relaxation in the time period for submission of the appropriate Bank Guarantees in terms of Regulation 8.2 (c) of the said regulations. Tata Power Renewable Energy Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/89-MP-2025_190225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 and its subsequent Clarification and replacement, if any, with respect to grant of Transmission License to Eastern Region Expansion Scheme -XXXIX Power Transmission Limited. ERES – XXXIX Power Transmission Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/514-AT-2024_190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003 challenging the Bills of Supply for Bilateral Charges raised by Central Transmission Utility of India Ltd. being contrary to the CERC (Sharing of Inter-State Transmission Charges and losses) Regulations, 2020 and CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 ReNew Solar Power Pvt. Ltd. & Anr., ReNew Surya Ojas Pvt. Ltd., ReNew Solar Power Private Limited and Anr.", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/111-MP-2024_190225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for adoption of Transmission Charges with respect to Transmission System Being established by the Khavda V-A Power Transmission Limited. Khavda V-A Power Transmission Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/72-AT-2025_190225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section-63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by Pune - III Transmission Limited. Pune - III Transmission Limited", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/75-AT-2025_Anr._190225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) read with Section 79(1)(f) of the Electricity Act, 2003, and applicable provisions of the CERC (Connectivity and General Network Access to the Inter-State Transmission System) Regulations, 2022 and the CERC (Conduct of Business) Regulations, 2023 seeking revision of Effective Date of 100 MW General Network Access granted in favour of Petitioner. Hindalco Industries Limited.", "date": "2025-02-19", "url": "https://cercind.gov.in/2025/ROP/83-MP-2025_190225.pdf"}, {"type": "Orders", "title": "Petition under Section 63 of the Electricity Act, 2003 for adoption of tariff for 1200 MW Wind Solar Hybrid Power Projects (Tranche-VIII) connected to the Inter-State Transmission System (ISTS) and selected through competitive bidding process as per the guidelines of the Government of India. Solar Energy Corporation of India Limited", "date": "2025-02-18", "url": "https://cercind.gov.in/2025/orders/268-AT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 62 and 79 (1) (a) of the Electricity Act, 2003, read with Regulation 9 (4) of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024, for seeking approval of input price of coal supplied from the Amelia coal mine to the end use generating station for the period from the date of commercial operation, i.e. 18.2.2025 to 31.3.2029. THDCIL", "date": "2025-02-18", "url": "https://cercind.gov.in/2025/ROP/551-MP-2025_240625.pdf"}, {"type": "Orders", "title": "Petition for approval of tariff of Talcher Super Thermal Power Station Stage-I (1000 MW) for the period from 2019-24. NTPC Limited", "date": "2025-02-17", "url": "https://cercind.gov.in/2025/orders/436-GT-2020.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the LILO of 220 kV S/C Panki-Naubasta Transmission Line at Kanpur in Northern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-02-17", "url": "https://cercind.gov.in/2025/orders/154-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset under “02nd 315 (3X105) MVA, 400/220 kV Transformer at Indravati (OHPC) Switchyard” in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-02-17", "url": "https://cercind.gov.in/2025/orders/9-TT-2025.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Rajasthan IV A Power Transmission Limited. Rajasthan IV A Power Transmission Limited", "date": "2025-02-14", "url": "https://cercind.gov.in/2025/orders/316-TL-2024.pdf"}, {"type": "Orders", "title": "Application under Sections 14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of a transmission licence to Rajasthan IV E Power Transmission Limited. Rajasthan IV E Power Transmission Limited", "date": "2025-02-14", "url": "https://cercind.gov.in/2025/orders/313-TL-2024.pdf"}, {"type": "Orders", "title": "Application under Section 15 (1) of the Electricity Act, 2003 read with Regulation 6 (1) of CERC (Procedure, Terms and Conditions for Grant of Trading License and other related matters) Regulations, 2020 for grant of Category V license for Inter-State trading of Electricity in all States and Union Territories of India in accordance with CERC (Procedure, Terms and Conditions for Grant of Trading Licence and other related matters) Regulations, 2020 amended from time to time. Sunsure Power Markets Private Limited", "date": "2025-02-14", "url": "https://cercind.gov.in/2025/orders/150-TD-2025-1.pdf"}, {"type": "Orders", "title": "Petition under Section 14 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for the grant of a separate RTM Transmission License to POWERGRID Neemuch Transmission System Limited. POWERGRID Neemuch Transmission System Limited", "date": "2025-02-14", "url": "https://cercind.gov.in/2025/orders/477-TL-2024.pdf"}, {"type": "Orders", "title": "Petition under Section-14 & 15 of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for Grant of separate Transmission License for Augmentation of 2x500 MVA, 400/230kV transformation capacity (3rd & 4th ICTs) at Karur PS and Implementation of 1 no. of 230kV line bay at Karur 400/230kV PS for interconnection of REGS of M/s Nannai Solar Park Pvt. Ltd. on Regulated Tariff Mechanism (RTM) route. Karur Transmission Limited", "date": "2025-02-14", "url": "https://cercind.gov.in/2025/orders/225-TL-2024-I.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the “Combined Asset of Transmission System associated with Rampur HEP” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/222-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the 400 kV S/C Kankroli-Jodhpur Transmission Line along with associated bays under “System Strengthening Scheme in South-Western Part of Northern Grid (Part-B)” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/219-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Combined Asset comprising of “Asset-1: Kalpakkam PFBR-Sirucheri 230 kV D/C Line and Asset-2: Kalpakkam PFBR-Arani 230 kV D/C Line, and Asset-3: Kalpakkam PFBR-Kanchipuram 230 kV D/C Line” under “Transmission system associated with Kalpakkam PFBR (500 MW) project” in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/218-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Combined Assets under “Transmission System Associated with North-West Transmission Corridor Strengthening Scheme” in both Western and Northern Regions. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/213-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period in respect of the “Spare Converter Transformer at Rihand for Rihand-Dadri HVDC Bipole Terminal” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/206-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Combined Asset consisting of Asset-1: 315 MVA 400/220 kV Spare Inter-Connecting Transformer at 400/220 kV Hisar Sub-station, Asset-2: 315 MVA 400/220 kV Spare Inter-Connecting Transformer at 400/220 kV Lucknow Sub-station; and Asset-3: 315 MVA, 400/220 kV ICT at Bhiwadi in the Northern Region under “Provision of spare ICTs and reactors in Eastern, Northern, Southern and Western Regions”. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/134-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Combined Asset under “Installation of Reactors (Part-II)” in the Western Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/122-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Assets under “Augmentation of Transformer and Bays” in the Western Region”. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/108-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for “400/220 kV Khandwa Sub-station and LILO of 400 kV D/C Itarsi-Dhule Transmission Line at Khandwa” in the Western Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/111-TT-2025_others_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the Combined Asset Transmission System associated with “System Strengthening Scheme (Formerly Tala Supplementary Scheme)” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/182-TT-2025_120225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 period and determination of transmission tariff for the 2024-29 period for the “Combined Asset under ERSS-IV” in the Eastern Region. Power Grid Corporation of India Limited", "date": "2025-02-12", "url": "https://cercind.gov.in/2025/ROP/28-TT-2025_120225.pdf"}, {"type": "Current Regulation", "title": "11. Procedure for payment for Black Start Support - date 12.02.2025", "date": "2025-02-12", "url": "https://cercind.gov.in/regulations/IEGC-Procedure-for- black-start_CE-SAC.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for  truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset under “63 MVAR Line Reactor on 400kV Kolaghat-Rengali line at Rengali Sub-station” in Eastern Region. Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/10-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for  truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Asset-I: 220 kV Jallandhar-Hamirpur D/C Transmission Line along with associated bays in Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/7-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the “Combined Asset: comprising Asset-I: 315 MVA, 400/220 kV ICT at Mandola and Asset-II: 315 MVA, 400/220 kV ICT at Ludhiana under “Spare ICT Scheme” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/5-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the “System Strengthening Scheme in Roorkee” in the Northern Region Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/4-TT-2025.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for truing up of transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and determination of transmission tariff for the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for 400 kV D/C Kaiga-Sirsa transmission line in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/37-TT-2025.pdf"}, {"type": "Orders", "title": "Petition for truing up of the transmission tariff for the 2019-24 tariff period and determination of the transmission tariff for the 2024-29 tariff period for the Combined Asset: Comprising Asset-1: 315 MVA ICT-III at Ludhiana Sub-station; and Asset-2: Bay extension work at Wagoora Sub-station under “Northern Region System Strengthening Scheme-VII (NRSS-VII)” in Northern Region under Section 62 read with Section 79 (1)(d) of the Electricity Act, 2003 and under Regulation 15 (1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 read with the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024. Power Grid Corporation of India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/orders/8-TT-2025.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Barmer I Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Barmer I Transmission Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/510-AT-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect \"to the Transmission System being established by the Khavda PS1 and 3 Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Khavda PS1 and 3 Transmission Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/508-AT-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 for amendment of existing RTM Transmission Licence to POWERGRID Bikaner Transmission System Limited to include transmission project \"Implementation of Bus Sectionalizer at 400 kV level of 400/220 kV Bikaner-II PS” and “Augmentation of Transformation Capacity at 400/220 kV Bikaner-II PS in Rajasthan by 400/220 kV, 1×500 MVA ICT (9th). POWERGRID Bikaner Transmission System Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/487-TL-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) of the Electricity Act 2003 for adjudication of disputes between the Petitioner and the Respondent for direction for payment. DVC", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/319-MP-2019_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(c) and (f) of the Electricity Act, 2003 read with applicable provisions of the Central Electricity Regulatory Commission (Connectivity and General Network Access to the inter- State Transmission System) Regulations, 2022 and Central Electricity Regulatory Commission (Grant of Connectivity, Long- Term Access and Medium-term Open Access in Inter-State Transmission and Related Matters) Regulations, 2009. THDC India Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/497-MP-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 79(1)(f) of the Electricity Act, 2003 for adjudication of disputes in relation to the claims of Adani Power Limited for Part Load Compensation purportedly under the IEGC for FY 2021-22, 2022-23, 2023-24 & 2024-25 and other reliefs. Gujarat Urja Vikas Nigam Limited , Adani Power Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/469-MP-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 (1)(a), (c) & (f) of the Electricity Act, 2003 read with Regulation 13(8) of the CERC (Sharing of inter- State Transmission Charges and Losses) Regulations, 2020 and Regulation 11 of the Central Electricity Regulatory Commission (Deviation Settlement Mechanism and related matters) Regulations, 2022. NTPC Green Energy Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/319-MP-2023_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and (f) of the Electricity Act, 2003. Avaada Energy Private Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/240-MP-2024_110225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(d) of the Electricity Act, 2003 read with Regulation 3(9)(a) and 8(5)(ii) of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2014 and Regulation 3(10)(a) of the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019. Powerlinks Transmission Limited", "date": "2025-02-11", "url": "https://cercind.gov.in/2025/ROP/254-MP-2023_110225.pdf"}, {"type": "Orders", "title": "Application under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of transmission licence to Rajasthan IV C Power Transmission Limited. Rajasthan IV C Power Transmission Limited", "date": "2025-02-08", "url": "https://cercind.gov.in/2025/orders/317-TL-2024-F.pdf"}, {"type": "Orders", "title": "Petition for truing-up of tariff for the period 2014-19 and for determination of tariff for the period 2019-24 in respect of Dadri Loni Road 400 KV D/C dedicated Transmission Line associated with National Capital Thermal Power Station, Dadri-II (980 MW). NTPC Limited", "date": "2025-02-07", "url": "https://cercind.gov.in/2025/orders/89-GT-2023.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for 400 kV S/C Chamera-1 Kishenpur Transmission System in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-07", "url": "https://cercind.gov.in/2025/ROP/141-TT-2025_070225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the assets under the Transmission System associated with immediate evacuation system for Nabinagar TPS in Eastern Region. Power Grid Corporation of India Limited", "date": "2025-02-07", "url": "https://cercind.gov.in/2025/ROP/132-TT-2025_070225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for Asset-1: 2 No. 400 kV line bays at Fatehpur 400/220 kV Sub-station under “Provision of 400 kV bays at Fatehpur for ATS under Unchahar TPS” in the Northern Region. Power Grid Corporation of India Limited", "date": "2025-02-07", "url": "https://cercind.gov.in/2025/ROP/91-TT-2025_070225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for truing up of transmission tariff for the 2019-24 tariff period and determination of transmission tariff for the 2024-29 tariff period for the “Combined Asset : Asset-1: 400 kV D/C Raigarh-Raipur Transmission Line along with associated bays; Asset-2: 400 kV D/C Ranchi-Rourkela Transmission Line and extension of Ranchi Sub-station; Asset-3: Provision of 40% fixed series compensation package at Raipur Sub-station; Asset-4: 400 kV D/C Rourkela-Raigarh Transmission Line and associated bays at Raigarh and Rourkela under “East-West Transmission Corridor Strengthening Scheme in Western Region”. Power Grid Corporation of India Limited", "date": "2025-02-07", "url": "https://cercind.gov.in/2025/ROP/23-TT-2025_Ors._070225.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and under Regulation 15(1)(a) and Regulation 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for the truing-up of transmission tariff for the 2019-24 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and for the determination of transmission tariff for the 2024-29 period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset: 400 kV D/C Gorakhpur-Lucknow transmission line along with its associated bays; and 30% FSC on 400 kV D/C Gorakhpur-Lucknow transmission line at Lucknow along with bays under “Northern Region System Strengthening Scheme-X” in the Northern Region”. Power Grid Corporation of India Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/orders/453-TT-2024.pdf"}, {"type": "Orders", "title": "Approval under Section 62 read with Section 79(1)(d) of the Electricity Act, 2003 and Regulations 15(1)(a) and 23 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 2023 for  truing up of the transmission tariff for the 2019-24 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2019 and the determination of transmission tariff of the 2024-29 tariff period under the Central Electricity Regulatory Commission (Terms and Conditions of Tariff) Regulations, 2024 for the Combined Asset comprising of Asset-I: LILO of both circuits of 400kV D/C Gazuwaka-Vijayawada Transmission Line at Vemagiri and Asset-II: Extension of 400/220 kV Sub-station at Vijayawada under System Strengthening-VI of Southern Region Grid in the Southern Region. Power Grid Corporation of India Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/orders/376-TT-2024.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 14 of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 for grant of separate RTM Transmission License to POWERGRID Neemuch Transmission System Limited. POWERGRID Neemuch Transmission System Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/478-TL-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 29(5) of the Electricity Act, 2003 read with Regulation 111 of the Central Electricity Regulatory Commission (Conduct of Business) Regulations, 1999 and Regulation 2.3.1 (7) of the Central Electricity Regulatory Commission (Indian Electricity Grid Code) Regulations, 2010. Tata Power Renewable Energy Limited , Electro Solaire Private Limited, Gujarat Industries Power Company Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/13-MP-2024_Ors._060225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the South Olpad Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). South Olpad Transmission Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/493-AT-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Sections 14, 15 and 79(1)(e) of the Electricity Act, 2003 read with Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission Licence and other related matters) Regulations, 2024 with respect to grant of Transmission Licence to Navinal Transmission Limited. Navinal Transmission Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/426-TL-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sections 14, 15, 79(1)(e) of the Electricity Act, 2003 read with the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for Grant of Transmission License and other related matters) Regulations, 2024 with respect to Grant of Transmission Licence to Jamnagar Transmission Limited. Jamnagar Transmission Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/424-TL-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Jam Khambhaliya Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Jam Khambhaliya Transmission Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/490-AT-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79 of the Electricity Act, 2003, read with Section 38 and Regulations 4.1, 5.6 and 17.1(iii) of the General Network Access Regulations, 2022, thereby imploring this Commission to exercise its regulatory powers, for the purpose of facilitating the Petitioner to obtain General Network Access for the Petitioner’s Petrochemical Plant located at Dahej, Gujarat at the DGEN Switchyard and DGEN dedicated Transmission Line of Torrent Power Limited. Reliance Industries Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/246-MP-2024_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(f) read with Section 19 of the Electricity Act, 2003 read with Regulation 9, 19 and 20 of the Central Electricity Regulatory Commission (Procedure, Terms and Conditions for grant of trading license and other related matters) Regulations, 2020 seeking recovery of penalty for less return of power by the Respondents as per Banking Agreements executed between the Petitioner and the Respondents and seeking revocation of the inter-State trading license granted to respondent No.1. Kreate Energy (I) Private Limited, Haryana Power Purchase Centre, Arunachal Pradesh Power Corporation Pvt. Ltd.", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/94-MP-2023_060225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Section 63 of the Electricity Act, 2003 for Adoption of Transmission Charges with respect to the Transmission System being established by the Bikaner A Power Transmission Limited (a 100% wholly owned subsidiary of Power Grid Corporation of India Limited). Bikaner A Power Transmission Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/64-AT-2025_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition for approval of the transmission tariff of the \tCombined Assets of LILO of 400 kV S/C \tVindhyachal-Korba transmission line and 400 kV \tD/C Gandhar-Hazira transmission line and \t400/220 kV GIS Sub-station at Hazira and \tassociated bays and 400 kV D/C Quad Moose \ttransmission line from Mahan Thermal Power \tPlant-Sipat Pooling Sub-station and associated \tbays for the years 2012-13 and 2013-14 in the \t2009-14 tariff period. Essar Power Transmission Company Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/173-TT-2013_060225.pdf"}, {"type": "Record of Proceedings", "title": "Petition under Section 79(1)(c) and Section 79(1)(k) of the Electricity Act, 2003 read with Regulation 41 and Regulation 42 of the Central Electricity Regulatory Commission (Connectivity and General Network Access to Inter-State Transmission System) Regulations, 2022 inter alia seeking exercise of ‘Power to Relax’ and ‘Power to Remove Difficulty’ by the Commission to relax Regulation 12.5 of the GNA Regulations, 2022 and issue appropriate directions to CTUIL for developing the necessary transmission system augmentation as part of Common Transmission System/ part of Inter State Transmission System relaxing the compliance of Regulation 12.5 of GNA Regulations, 2022 by the Petitioner. AM Green Ammonia (India) Private Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/160-MP-2025_060225.pdf"}, {"type": "Record of Proceedings", "title": "Application under Sub-Section (1) of Section 15 of the Electricity Act, 2003 for grant of Category IV licence for inter-state trading in electricity in India. KVK Energy & Infrastructure Private Limited", "date": "2025-02-06", "url": "https://cercind.gov.in/2025/ROP/84-TD-2025_060225.pdf"}], "Grid India": []}, "state_map": {"Andhra Pradesh": [], "Arunachal Pradesh": [], "Assam": [], "Bihar": [], "Chhattisgarh": [], "Goa": [], "Gujarat": [], "Haryana": [], "Himachal Pradesh": [], "Jharkhand": [], "Karnataka": [], "Kerala": [], "Madhya Pradesh": [], "Maharashtra": [], "Manipur": [], "Meghalaya": [], "Mizoram": [], "Nagaland": [], "Odisha": [], "Punjab": [], "Rajasthan": [], "Sikkim": [], "Tamil Nadu": [], "Telangana": [], "Tripura": [], "Uttar Pradesh": [], "Uttarakhand": [], "West Bengal": []}, "ut_map": {"Andaman and Nicobar Islands": [], "Chandigarh": [], "Dadra and Nagar Haveli and Daman and Diu": [], "Delhi": [], "Jammu and Kashmir": [], "Ladakh": [], "Lakshadweep": [], "Puducherry": []}, "last_updated": "2025-10-08 11:27:36 IST"}